[{"text":"🄱🄾🄾🄺 🅁🄴🅅🄸🄴🅆\n\nMaia Kobabe | “Gender Queer”\n\n3½⭐⭐⭐✨\n\nDear queer* people, please never stop writing.\n\nMaia Kobabe's memoir (e/em/eir) is an enlightening addition to literature on the nonbinary experience, especially written by someone assigned female at birth (afab) - I do not own that many books like this. Started as a way to explain to eir family what it means to be nonbinary and asexual, the book is more than a personal story: it is a useful and touching guide on gender identity - what it means and how to think about it - for advocates, friends, and humans everywhere.\n\nThe way the story is told took some getting used to as it did not flow as I usually prefer, feeling almost stream of consciousness-y at times in the way that e jumps from one point of the eir life to the next depending on the memory linked to the story being presently told.\n\nGender Queer reads as real as queer nonfiction can get, and that’s the part that makes the book all the more important - it provides information that most young people going through this stuff can not find elsewhere but the internet, which is a dangerous place. Kobabe gifts us with eir experiences, and we get to feel what e feels because the brutally honest depictions aren’t there to serve as graphic trauma porn but an experience. We feel it all - the confusion, dissatisfaction, questioning, the dysphoria. I appreciated how we were able to be invited into most of these defining moments in eir journey of discovery; like trying to understand teenage crushes, buying and trying out sex toys and how mortified and traumatised e felt during eir first pap smear - something they define as having been invasive, bearing psychological scarring.\n\nAs an enby reader, reading about a journey of coming to claim one’s own identity in spite of society’s need to define you and coming out victorious in such a sense that you become empowered to write your own story how you see fit; quotes like “I want people to be confused about my gender at all times.” and “I don’t want MORE gendered traits, I want LESS.” hit home and made me feel understood, something every queer person should get to feel. \n\nThis is such a great resource.\n\n—Nkeshyy 💋","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/225592217_511495673265305_9063112323056361226_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=OeAmfC26WdkAX-CF3BZ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfA_w8-T7qTTSOh19ErI1MO5XuAppvwbE-PIa2jDQ16wZQ&oe=636EBB19&_nc_sid=76ac9f"},{"text":"GENDER QUEER by Maia Kobabe\n\nIn 2014, Maia Kobabe, who uses e/em/eir pronouns, thought that a comic of reading statistics would be the last autobiographical comic e would ever write. At the time, it was the only thing e felt comfortable with strangers knowing about em. Now, Gender Queer is here. Maia's intensely cathartic autobiography charts eir journey of self-identity, which includes the mortification and confusion of adolescent crushes, grappling with how to come out to family and society, bonding with friends over erotic gay fanfiction, and facing the trauma of pap smears. Started as a way to explain to eir family what it means to be nonbinary and asexual, Gender Queer is more than a personal story: it is a useful and touching guide on gender identity--what it means and how to think about it--for advocates, friends, and humans everywhere. \n\n~~~~~~~~~~~\n\n“I began to think of gender less as a scale and more of a landscape…. Some people are happy to live in a place they were born, while others must make a journey to reach the climate in which they can flourish and grow.”\n\n~~~~~~~~~~\n\nI think every person who aspires to be a trans ally needs to read this book. It’s raw and real and I found myself laughing and teary throughout. Maia and I do not share the same gender identity, but I related to so much of eir experiences. \n\nThis book is one of the most banned books in the country right now, and Virginia is currently suing Kobabe and eir publisher over it—this is scary, because we need books like this in order to learn and see ourselves. So GO READ THIS BOOK. The deluxe edition releases in a few days, so this is a perfect time to go preorder it!\n\n~~~~~~~~~~\n#maiakobabe #genderqueerbook #genderqueer #graphicnovels #queermemoir #memoir #lgbtqbookstagram #lgbtqbooks #bannedbooks #nonbinary #transgender #genderqueerpride","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/291228264_461666589121727_2160268985671012014_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=GniWCJliqhoAX-B5Kby&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfALA22Z0SLeD4J1vSQ93e1e74fYPVfzExTH3AAK22HdZw&oe=636F48C1&_nc_sid=76ac9f"},{"text":"💛🤍💜🖤 Gender Queer: A Memoir by Maia Kobabe 💛🤍💜🖤\n•\nIf you are considering reading one LGBTQ+ themed book during this Pride Month, please choose this one.\n💛 Just like the subtitle states it, this graphic novel is basically the author’s autobiography. It is about eir journey to find emself and to define who e is.\n🤍 This is probably the best graphic novel I will ever read. It is actually only my third one, but I am sure about this. I love the illustrations and the fact how deep a text written into speech bubbles can be.\n💜 Here is my favourite quote:\n“As I pondered a pronoun change, I began to think of gender less as a scale and more as a landscape. Some people are born in the mountains, while others are born by the sea. Some people are happy to live in the place they were born, while others must make a journey to reach the climate in which they can flourish and grow.\nBetween the ocean and the mountains is a wild forest. That is where I want to make my home.”\n🖤 I recommend this book to all my allosexual and cisgender fellow readers. I have learnt so much from it.\n•\nRepresentation: non-binary and asexual\n#whatjulcsihasread #genderqueerbook #genderqueer #nonbinaryrepresentation #asexualrepresentation #maiakobabe #graphicnovel #pridemonth #lgbtqreads #lgbtqbooks #queerreads #queergraphicnovels #bibliophile #bookaholic #kirjastolainat #librarybooks #readmorelibrarybooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/289339765_1059236254971163_5888368359404761189_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=coPw0MtqAeAAX-4vaRP&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfD6PCsTEYlJpG9P9ohar56Vp-pd22Fz1ZXgJep_FI76Ag&oe=636E66FB&_nc_sid=76ac9f"},{"text":"📖 Découverte du roman graphique \n\"Genre Queer - une autobiographie non binaire\" 🏳️‍🌈\n\n✏🎨 Auteurice et illustrateur.trice : Maia Kobabe\n📚 Maison d'édition : @casterman_bd \n\nCet ouvrage parle de la jeunesse de Maia, de ces questions sur son genre, sa sexualité, son.sa coming out des injonctions de la société qui te force à rentrer dans une case. 😞\nC'est super touchant et puissant.\nIl y a beaucoup d'infos. J'ai moins compris le passage avec Patricia Churchland. \n\n▶Ouvrage dispo dans l'une des médiathèques de l'@agglopvm","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/310755938_409996161321269_4459887821713034182_n.webp?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=WWy5v_4MFHEAX9TLf8E&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDzFwncd61dgmK5E5Ul0O00RIl_h7T9I9vqcjvaZn-qVg&oe=636F2FEF&_nc_sid=76ac9f"},{"text":"Banned books. My feelings on this week are so muddled, and my time in libraries, only opened more complex feelings. \n\nI only recently read Maus. It was my oldest brother's favorite book growing up, and we hated each other, and per sibling code, *I* couldn't also read it and enjoy it, too. \n\nIt's not an easy book, and it surprised me by opening many questions on generational trauma, survivor's guilt, and navigating relationships through PTSD. I always appreciate a book that leaves you with more questions than answers.\n\nWhy is it banned? Nudity and swearing, is the most common reason. Nudity. Of an approximate one inch crude mouse drawing. Way to miss the whole fucking point.\n\nGender Queer. We've all heard it get cited in multiple bans this past year. And by cited, I mean a singular panel, pulled out of context and paraded around, as though they care about children.\n\nIf they cared, they'd read the book, and see in the blow job panel they use is a strap on, and are in the middle of a very important discussion involving consent and autonomy. It gives teens the example of, even in the middle of any sexual activity, consent can be revoked.\n\nI wish nothing but terrible things on the people currently on their crusade against queer books. \n\nHow do you feel about banned book week?","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/307792649_144133888026033_8904999441327344915_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=JGQkvRZG-GMAX-51VPK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC_wIzVSjcp4W-UGs6t99QrmSRty4HgGkkMF76PXSz-dA&oe=636F9D47&_nc_sid=76ac9f"},{"text":"I finished reading @redgoldsparks Gender Queer the other day and it was really incredible. I don't think there's anything out there quite like it right now, and there certainly wasn't while I was growing up. My wife and I recently moved from one of the most liberal cities in our state to someplace more typically midwest. There's a lot of conservative political signs here... A few of those red hats... And like seriously just white people. But I found this book at the local library and I felt a tiny bit better. I had forgotten how books can be a lifeline. I hope other queer people in this town and other towns like it all over the country can find books like this and see themselves reflected back in the pages and find a little comfort\n#queerestgear #genderqueer #redgoldsparks #maiakobabe #midwest #midwestgay #genderqueerbook #gayliterature  #gaybooks #transliterature #transbooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/121264798_349894169427903_1499062427945265423_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=AQmLg97ZhdIAX9VKumh&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCy-nEtPHmlP9g5XgghC6IkDA-y832shQ0y6CxbRY53Uw&oe=636E5C53&_nc_sid=76ac9f"},{"text":"Friends. Friends. Do you ever read a book that leaves you fully speechless? Like. You read it, and it reached down into your heart and squeezed and made you feel so many things that you don’t even know how to find the language to describe the feeling? This. This book did that for me. \n\nI have almost nothing in common with Maia Kobabe. I am cis, a sexual being, and not even remotely artistic. Maia is genderqueer, asexual, and deeply talented artistically, as is evident by this incredible art. But, somehow, I felt connected to eir story in a way I haven’t in a long time. I’m not sure if it was eir’s beautiful way of describing eir journey with gender and sexuality through books and art or just the stunning storytelling, but this book was a revelation and a window and a deeply emotive experience. Thank you to everyone who recommended this to me this month and fully yelled at me for not reading it yet (seriously, HOW has it taken me so long to get to it???) I am so so grateful to this community for continuing to share and educate and spread love of good books! \n\nIf you, like me, haven’t gotten to experience this one yet, I highly HIGHLY recommend picking it up ASAP. \n\n[ID: I am standing in front of an out of focus colorful bookshelf, smiling and holding a copy of Gender Queer, and wearing a black tie front short sleeve shirt and blue jeans and brown wire frame glasses. My long brown hair falls over my left shoulder.]","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/212078776_1986940141474579_4947075652382948057_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=wQdeGqxf6WAAX9xfpia&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBSOQtUf_lrNyrGFdaEmE5DurGtEhUJ8Zh1vMbnad8NRA&oe=636E6432&_nc_sid=76ac9f"},{"text":"#quoteofthemoment #maiakobabe #genderqueerbook #Pride #pridemonth #westhamptonmalibrary","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/287743892_751797512525735_560603685554838485_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=j-PZ92M4GjQAX-y2rxH&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDXHpumN-dZg7c5k2BDNhLWG-97VXMRVZpKn9UKSBghMw&oe=636E91D7&_nc_sid=76ac9f"},{"text":"Thoughts on Gender Queer by Maia Kobabe\n\nMy Quick Take: For those who think the freedom to read is important, the lawsuit against this book is important to be aware of. And it’s an excellent graphic novel! \n***\nThanks to @bookriot podcast for highlighting this issue! \n\nI’ll direct you to my blog for my detailed thoughts about the book and the suit. I go into greater depth and I hope you’ll find it useful to get information and perhaps interested enough to pick up the book: \nhttps://www.trishtalksbooks.com/2022/07/a-very-challenged-book-review-and.html\n\nI’ve pulled from my blog entry, and included a quote from the author in the pictures here. \n\nGender Queer is charged in Virginia for being “obscene for unrestricted viewing for minors” at a Barnes & Noble outlet. For fans of Sarah J. Maas (and I know that there are A LOT of you in BG land!) the other book in the lawsuit is A Court of Mist and Fury, which I’ve not read.The litigants then filed charges against Maia Kobabe and @onipress . \n\nMy response to this was to read the book. Kobabe (redgoldsparks), who uses the Spivak pronouns e/er/eir, has written er memoir as a graphic novel. I thought it was really good, thoughtful and also educational for me. It was an amazing example of an open, honest memoir. The art made the author’s struggle come alive on the page; the visuals were an integral part of the novel. It is simply and effectively coloured by @phoebekobabe.psd. Be aware: It didn’t shy away from uncomfortable and explicit discussion and art , but in my opinion, it all served the story. It’s not a book intended for youngsters, but was written for older teens and adults specifically. \n\nMost think the suit will fail. The agenda here may be an attempt to garner publicly and capture right-leaning votes. But it is alarming nonetheless. And in Canada? It could never happen…but I don’t know. Things change, and a bit of vigilance is not a bad thing.\n\nI’m curious: Were you aware of this lawsuit, for either Gender Queer or A Court of Mist and Fury? If you’ve read them, what are your thoughts?","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/292867061_569319498117796_3555618395531965208_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=eu3iBttsM5EAX9ZB3oq&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBO70B56e0YXa78nEnPIxGOg1lemC6SMB6J1wojMrsCjQ&oe=636E7424&_nc_sid=76ac9f"},{"text":"Another book review!\n\nI first heard of Maia Kobabe’s “Gender Queer” because bigoted christians were trying to ban it.\n\nAnd it’s also a book about being gender queer (and ace!), and a *graphic memoir* at that. So of course I had to buy myself a copy.\n\nI laughed, I cried, and I felt so *seen* by this book, in a way that I, as an afab nonbinary person, rarely experience. (Note that Kobabe’s experience as a nonbinary person is not the same as mine, nor anyone else’s but Kobabe’s; however, there are plenty of similarities and points of resonance between some of what I felt & experienced and some of what e did. And some of what e wrote helped me better understand myself—like why I also suddenly hated being in pictures once I hit puberty.)\n\nThis memoir, so vulnerable and real, reflects how difficult, confusing, and at times isolating it is to come out to yourself (and others) as queer. Kobabe was raised in a fairly progressive, dare I even say slightly hippie kind of family, but e still experienced a lot of anxiety around coming out as nonbinary. In the book, e even includes a scene about a feminist aunt who accused em of being nonbinary solely because e had internatlized misogyny (which is not why afab people are nonbinary!).\n\nUnfortunatley we live in a sh*tty world where we have to fight for the ability to be ourselves and live in peace. And it's hard and scary and intimidating, but it's so comforting to know that there is a community that exists to welcome us with open arms—a community with some of its own issues and bigotry to overcome, yes, but a place where overall, dialogue and freedom and authenticity are celebrated. And I love how many creative queer people are sharing their stories and experiences, letting struggling or scared queer people know that we're not alone.\n\nSo anyway. I highly recommend this graphic novel, whether you’re trans or not.\n\nAnd I’m so, so glad this book exists.\n\n*Photos may not be in page-number order\n\n#genderqueer #afab #agender #maiakobabe #genderqueerbook #graphicnovel #graphicmemoir #graphicnovellgbtq #nonbinary #bookreview #trans #youshouldreadthis #queerbooks #bannedbooks #librariesareawesome #tamorapierce #genderdysphoria","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/312141992_195494999587293_7725368880804107894_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=Dj8aDu6qSyAAX_Rme5J&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDu_wfo9-Ivx1AhtiJ9fp-NNB9JpNGOMjmZcsbFzE8i8Q&oe=636F0F0A&_nc_sid=76ac9f"},{"text":"BANNED BOOKS WEEK\nCountdown of the top 10 banned/challenged books of 2021.\n#1. Gender Queer by Maia Kobabe\nReasons: Banned, challenged, and restricted for LGBTQIA+ content, and because it was considered to have sexually explicit images\n\n#bannedbooks #bannedbooksweek #bannedbooksweek2022 #readbannedbooks #biography #memoir #autobiography #nonfictionbooks #lgbtbooks #genderqueerbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/308297464_1502091863548133_2844180420217390472_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=-T3xXAwOxyoAX_rLuLo&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAYFusNUC05Kcbs9FFulbY1EjNVo9mruXL6FqsURaDLbA&oe=636E390D&_nc_sid=76ac9f"},{"text":"A graphic created by the American Library Association. The top portion depicts birds colored in hues of the rainbow with the words, \"Books unite us.\" The bottom portion is black with three birdcages with black silhouettes of a bird in each one. Below are the words, \"Censorship divides us.\" The top, colorful and positive message is much larger than the bottom, monochrome and negative image.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/307875109_774895083769710_8701941694154360424_n.webp?stp=c0.75.600.600a_dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=xT8NigFRsygAX-gjNBW&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC6Q1ThjQRSoP-N03mohvefH8YqkGYMVjaxIpxRr82Hpg&oe=636F0366&_nc_sid=76ac9f"},{"text":"We recently read Maia Kobabe's GENDER QUEER: A MEMOIR on Raman’s other not-so-secret podcast #QuarantinedComics. What started as a series of Instagram posts to explain to the author's family what it means to be nonbinary and asexual, Gender Queer becomes so much more than a personal story: it is a useful and touching guide on gender identity—what it means and how to think about it—for advocates, friends, and humans everywhere.⁠\n⁠\nIn light of all the other not so positive change happening in our society, it felt really important to read Gender Queer, and can't recommend this book enough. Warning, this is one of the rare episodes where Raman & @twicetold agree on almost everything.⁠\n⁠\nListen at our link in bio.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/306375781_634323104694288_2716279278760382492_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=m5no8prLGNsAX9v--Vk&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAVm--E7WTcgqwMEyFwUHryqaJLg0NO7kHDSSz2R3hTTA&oe=636F1CC0&_nc_sid=76ac9f"},{"text":"Thanks to @allshewrotebooks 2 of the beautiful deluxe editions and one of the older editions of Gender Queer are headed to @littlequeerlibrarywaltham to join other copies collected to send to Little Free Libraries in Texas! Hopefully just in time for banned books week!\n\nIt was super hard to let those new copies go. They are gorgeous!\n\nPer the usual, all books get a sticker. I’m still working on my stamp so more stickers.\n\n#bannedbooks #readingbannednetwork #genderqueerbook #texas #readingisfundamental #littlefreelibrary #freelittlelibrary #flltbrp #stewardsofinstagram #bookstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/301585265_3209697242620530_4825630657826806245_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=cCo70FuimlgAX-dLj1z&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCmzRw7hYVGhH6yRBV2q2fAgWqxtc0p3MYpOWW1iXBW4Q&oe=636E75D0&_nc_sid=76ac9f"},{"text":"At the beginning of the month, a school board in Utah decided they were going to ban 52 books from their libraries.  They've received backlash and criticism and, so, as of 11 August, it appears they've decided they will only be \"temporarily restricting\" these books where parents can opt-in to allow their children to check them out.  \n\nhttps://pen.org/press-release/ban-on-52-books-in-largest-utah-school-district-is-a-worrisome-escalation-of-censorship/\n\nRegardless of their change of heart, this is yet another example lately of book banning.  These actions infuriate me.  These people who decide to ban books are trying to silence people who aren't like them or who tell a story about teenagers being teenagers (ex: Forever by Judy Blume).  Kids need to be able to read about someone who has the same life experiences they do.  Life is hard.  It's not fair.  I learned that from books...and from life.  As a child, my mother did not censor my books at all.  The Happy Hooker, fine.  It (at age 12), fine.  The song \"Shout at the Devil\" by Motley Crue?  Absolutely not!  (But that's another story).  \n\nFor the rest of the year, I'm going to choose 1 banned book a month and give it a read, or a re-read.  I'll start with one of the most controversial, Gender Queer.  Spoiler alert: I've already read this so this will be a re-read.  I'll get off my soapbox, for now, but this is a subject I'm passionate about.  \n\n#RepectReaders\n#FreedomToRead\n#BannedBooks\n#ReadBannedBooks\n#genderqueerbook\n#bannedbook #bookbans #bookchallenges #censorship \n#bookworm #bookstagram #bibliophile #whatimreadingnow #currentlyreading #augustreads\n #booknerds #horrorbooks #bookstagrammer \n #happyreading","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/301151224_776489076929823_8759001763564767739_n.webp?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=7_9Bdow0OpYAX-wWf1I&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCpgUzg6IblJAaTY51PJL9Fl0KQpUCXcHqO0_MLvizT0w&oe=636F96EC&_nc_sid=76ac9f"},{"text":"This is a great resource to go along with the last post about Gender Queer: A Memoir. And take headlines with a grain of salt. Nobody is having sex in this book.\n\nPosted @withregram • redgoldsparks I made a document of resources for librarians facing challenges against Gender Queer. Some of the links would also apply to a challenge against any other book as well, including the link to report challenges to the @americanlibraryassociation and the guides from @penamerica and @ncacensorship. This is something I’ve been collecting and emailing out over the past year, but I decided to make it more publicly available. It’s included on the bio page of my website and the linketree in my insta profile. #maiakobabe #genderqueer #genderqueerbook #genderqueeramemoir #bannedbook #bookbans #bookchallenges #censorship #censorshipresources","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/300007295_886007082371419_4483799206279630012_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=DZvE2gcFFecAX_GitNL&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCEqwcFziWdIynn4zNjT0M60c31GxzyCEp-zeinvQ2HVQ&oe=636E8160&_nc_sid=76ac9f"},{"text":"In this memoir told through a graphic novel, Maia Kobabe (e/em/eir) shares about eir discovery of gender identity in general and ultimately eir own gender identity awakening. Maia takes us through eir childhood, adolescence, first crushes, milestones, all while trying to figure out not only where e belongs in the world but also where e belongs in eir own space. I’ve read coming of age and coming of identity narratives before, but this one felt different. The understandings and explanations Maia gave felt new and very forgiving (of eirself and of others). I found reflections like this one profound: ✨“Some people are born in the mountains, while others are born by the sea. Some people are happy to live in the place they were born, while others must make a journey to reach the climate in which they can flourish and grow. Between the ocean and the mountains is a wild forest. That is where I want to make my home.”\n\nI’m going through a little comic book/graphic novel phase. It started when I discovered the Ms Marvel comics (more on that coming later) and found myself in a comic book store and realized how broad and diverse this format has become. I saw this book, flipped through a few pages, and was so excited to read more. A medium that is new to me, graphic novels are incredible. The author is able to relay so many more details with fewer words making it a pretty unique experience. If you are an avid graphic novel reader, I’m sure this sounds obvious but it was new to me and honestly I didn’t really know that it could be used to tell such a personal story. I am so late to the game and I am so glad I’m here now- it was really just a lot of fun to read and see all the graphics and details in the story telling and in the drawing. Format aside, this story itself was beautiful and captivating. \n\n✨“The clearest metaphor I had for my own gender identity in college was the image of a scale. A huge weight had been placed on one side, without my permission. I was constantly trying to weigh down the other side. But the end goal wasn't masculinity - the goal was balance.”","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/298579198_821499888837506_6999744194214770597_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=ccyLfwVJzx4AX8E1xzg&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDdQCE8m-lqPH1iH85w3bCppbbi3YH6Gx9jpkq40RcFsA&oe=636ED7EE&_nc_sid=76ac9f"},{"text":"Two graphic novels lie beside each other on a blanket.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/297782779_773254143811123_2050545200328273155_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=_HBje8OfXeIAX_EGoiF&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC-EZC4wBmk2P4s0-l9zr25H2SHOoJizvTSep4a1kTZ6A&oe=636E3C7C&_nc_sid=76ac9f"},{"text":"After seeing that a Michigan library was defunded over this book I immediately went to my local bookstore to buy a copy to see for myself what it is about this book that is making people go completely INSANE.\n\nAfter reading it, I still don't get it.\n\nI don't want to make assumptions about  parents who want this book banned, however, as a parent, if my teenager came to me questioning their gender, I would recommend this book and then discuss it with them. \n\nI recommend this book, go borrow it from your local library or buy a copy from your local indie bookstore so that you can see for yourself! \n\nPs. Read banned books! \n\n.\n.\n#genderqueer #lqbtqia #lgbtqiabooks\n#genderqueerbook #book #bannedbooks\n#readbannedbooks #bookdragon #bookworm\n#readallthebooks #bookstagrammer #diversifybookstagram #diversifyyourbookshelf","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/298147943_167118239220666_2917144142455205199_n.webp?stp=c0.120.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=HNKXg2RtrLcAX8nc-KO&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBZdpE-pDRgaG0j3PuQXNdwP3djP37iyhxAAtQq5VCVsQ&oe=636F993E&_nc_sid=76ac9f"},{"text":"Over a photograph of two copies of the book “Gender Queer: A Memoir” by Maia Kobabe, white text reads “Resources for book challenges: bit.ly/GenderQueerbans","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/297427519_504396631488173_3274866924121543882_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=NQWocCL9yygAX8xuAgx&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfChYjvcJEN66P0RfBgcgKXtz3xppp0MVTw6Q6MkpWbFfA&oe=636F02BB&_nc_sid=76ac9f"},{"text":"Now that Gender Queer by Maia Kobabe is one of the most banned and challenged books out there, I just had to read it!  And I thought it was really good!  I really liked how it went right back to eir childhood and looked at themes of gender roles even from a young age. \n\nAnd while I identify as a cis woman, there were still things in this book that I identified with.\n\nThis is a lovely and important book for folks to read.  Maybe you’ll gain a better understanding of yourself from reading it, or you’ll gain a better understanding of what it’s like to live outside the gender binary.\n⭐️⭐️⭐️⭐️\n\n#Bookstagram #Bookstagrammer #NSBookstagrammer #CanadianBookstagrammer #LGBTQBookstagram #QueerBookstagram #IReadBannedBooks #GenderQueer #GenderQueerBook #ReadDiverseBooks #ReadDiversely #Read #ReadersOfInstagram #ReadMoreBooks #ReadAllTheBooks #Bibliophile #LibraryBook #LibraryBookstagram #BannedBook #BannedBooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/295722237_787637579057865_3499978363416937479_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=082haBAbeyYAX-JV-ti&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAZ9FPn3wYybYWwKiMpDaZlSmJn-Me4uiPdU6LLtuorJw&oe=636F06B1&_nc_sid=76ac9f"},{"text":"Burn all copies of #genderqueerbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/294183090_1080635442536791_2565901616603172539_n.jpg?stp=c142.0.366.366a_dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=JYDu2a9nYVwAX_-bAJs&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCScIjkBlzfLKiyuCJj7_KaNzr3it1AEozsUjE0pI78Mg&oe=636F6FAF&_nc_sid=76ac9f"},{"text":"⚧Gender Queer⚧\nBy Maia Kobabe\n⭐️⭐️⭐️⭐️\n\nI picked this up from my library on the recommendation of fellow Washingtonian @bookaddictpnw Thank you Laurie! \n\nI think we need to listen more to stories and life experiences that are not our own and then just sit with it. It is an important practice to do so. Besides informing ourselves, it gives us the opportunity to remove ourselves from our own narratives and at the same time find ways to connect to each other through our commonalities. \n\nThis is a graphic memoir about the author’s experiences with coming to understand eir gender identity. It’s a coming of age memoir that both informs and is beautifully drawn. There are some depictions of some difficult things including traumatic medical examinations, so be forewarned about that. This is a great one to pick up if you are interested in learning more about gender identity or if you simply love a good graphic memoir. \n\nWhat was the last memoir you read?\n\n#graphicmemoir #genderqueerbook #maiakobabe #julyreads2022 #julyreads #libraryfinds #recommendedreading #justbooksbookstagram #bookstagram #bookstagrammer","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/293190523_551606853344400_3996849199621115917_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=yfPJn8AlzFkAX93zYxp&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBZyHeH6LotlfI2svPF8x3_lPQ5fPl_A0bjQNhSQRdkHw&oe=636EDCA3&_nc_sid=76ac9f"},{"text":"We're here, we're queer 🏳️‍🌈\n\nSvou queer knižní kolekci jsem před pár měsíci rozšířila o Gender queer - komiks, který by rozhodně neměl minout nikoho (a tady bych nejradši udělala tečku, ale přesto se pokusím specifikovat), kdo se potýká se zmatkem v hlavě ohledně své vlastní identity nebo kdo má někoho takového ve svém okolí. A až ho přečte, měl by ho dát přečíst všem, co zná. A pak ho poslat ještě dál.\n\nMožná mi úplně nesedla kresba, ale rozhodně mi sedly myšlenky, které tahle grafická novela předávala svým čtenářům a skutečně si myslím, že může jít o knížku plnou přelomových informací pro hromadu lidí. Že některým třeba dojde, že se tak, jako hlavní hrdina, cítí taky. A že na tom není nic špatně. A některým zase dojde, že se takhle může cítit někdo jim blízký. A že by ho/ji/je v tom měli podporovat a pomáhat jim. Protože s nimi není nic v nepořádku ❣️\n\nThat's it, that's the message. Thank you, redgoldsparks for sharing your story.\n\n#bookstagram #graphicnovel #genderqueerbook #genderqueer #bookstagrammer #graphicmemoir #memoirwriting #booksbooksbooks #lgbtqreads #queerbooks #readwithpride #lgbt #pride #maiakobabe #maiakobabebook #centralapublishing #centralabooks #comics #comicbook #shadow #hand #shadowhand #czbookstagram #czblogger #books #coctu #cocteme #booktip #bookishtip #whattoread","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/292523759_1783078388696833_682379111216956757_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=MHromoN0SW4AX8wrdcb&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCxf7a_ptF5KDpPH4Hgh5Dn7jJFzoAXMm2SjDOj9n85Wg&oe=636ED9AC&_nc_sid=76ac9f"},{"text":"Gender Queer, a memoir by Maia Kobabe\n\nSome people are born in the mountains, while others are born by the sea. Some people are happy to live in the place they were born, while others must make a journey to reach the climate in which they can flourish and grow. Between the ocean and the mountains is a wild forest. That is where I want to make my home. 💞📚💞\n\n#bookstagram #genderqueerbook #bannedbooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/292499597_339227941745298_5453055266734668490_n.webp?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=eod3xzrv5JMAX9z8GCB&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBEktNQEBDaBwHG7terPeNpT_WOB1EvVt34ggr_hfP-2w&oe=636ECE31&_nc_sid=76ac9f"},{"text":"My last completed read for June was this memoir of Maia Kobabe's journey to understand and define eir sexuality. I found the simple direct honesty of the writing and the illustrations impactful and so deeply human. \n\nI've always used books to help me understand and process the world and my place in it. As the parent of a non-binary teen, it's important for me to understand the ways in which even those of us parents who are supportive can unintentionally hurt our kids who are already facing so many challenges, as well as the ways we can support them as they find their way to joy. I also want to read as many different viewpoints as possible so I don't fall into the trap of thinking everyone's journey is the same. I was surprised when my kiddo showed up in a dress the other day, and had to remind myself that non-binary doesn't equal androgynous, even if that's how they usually choose to dress. \n\nI was shocked to read about the challenges the book and author have faced. (OK. Not shocked. I'm not that naive.) I wish more people would be open to reading about experiences different from their own and use those stories to humanize and empathize with others. Alas.\n\n#bookstagram #pridereads #genderqueerbook #genderqueer #graphicmemoir #junereads #tootiredtohashtag","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/291573035_560416789064129_8536360688588723862_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=pvzTiSLYJKMAX8ScmsN&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC7mdJmxqBSw6xQ8LkmPaWp9eZiYUgs1KWQZn-SLg6pFw&oe=636F15FA&_nc_sid=76ac9f"},{"text":"Gender Queer thoughts:\n⠀\nThis graphic memoir was superb. You know I love a memoir and this was something special. Maia Kobabe’s vulnerability and absolute honesty was so viscerally there. I could feel it and I loved every second of eir road to discovery.\n⠀\nI loved the journey that Maia made us privy to. Eir illustrations and writing and the way e told the story just all worked together so well to create a truly impactful and amazing graphic memoir.\n⠀\nBooks like these are so special and important and I’m so happy I finally read it. I loved the entire experience of reading this graphic novel. I felt as if Maia allowed us not only into eir truths but into eir very mind. Ugh I just loved this so much and I can’t recommend it enough.\n⠀\nRead it if you like memoirs or graphic novels or queer stories or self discovery stories. Basically if you enjoy reading at all this is an important and wonderful one.\n⠀\nTW/CW: medical trauma, blood, dysphoria, medical content, sexual content, transphobia, deadnaming, vomit, body shaming, this is a non exhaustive list please check storygraph for a fuller list.\n⠀\nID: Gender Queer lays on my black and white bedspread. End description.\n⠀","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/286206848_1176229563198817_8776418067807611789_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=sODD7TtyFmgAX8Bu1H0&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCSAMPkPuftL-DGZfnnp6IelJH4c-cNVoEHht2kynjjrQ&oe=636E71B8&_nc_sid=76ac9f"},{"text":"Many of you are fans of Sarah J. Maas @therealsjmaas and will be outraged by this attempt at censorship. In Virginia, a court has found probable cause to require the authors and publishers of two award-winning books to demonstrate why they do NOT meet the definition of “obscenity.” Learn more at @ncacensorship:\n\n\"It is contrary to our principles of democracy to allow anyone, regardless of their beliefs or political position, to determine what other Americans can read. An on-going legal action could profoundly limit the availability of books in Virginia. Prohibiting the sale of books cannot be tolerated under the First Amendment.\n\n\"Prohibiting the sale and distribution of books is an affront to our democratic values and threatens each person’s and each family’s individual liberties.\n\n\"We urge Virginians–and all Americans–to stand against any attempt to use government action to dictate what we can read and how to think about what we read.\"\n\nRead the coalition statement: http://ow.ly/wllI50Jnyre\n\n#Virginia #FReadom #censorship #courtofmistandfury #genderqueer #genderqueerbook #stopbanningbooks #nocensorship #nocensorshipforthearts","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/286316795_1198775444222956_6379458575289818689_n.jpg?stp=dst-jpg_e15&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=MtY7657cCMcAX_brZMZ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAF4ycXxmQeqXfJsyLE7N9Wq80WlL4NzHYQLgEa4SgODw&oe=636DE9B5&_nc_sid=76ac9f"},{"text":"This drives me BONKERS! Did anyone else see that in Virginia, politicians are trying to require that unless you're >18, Barnes & Noble can't sell you Gender Queer or ACOMF? 😡 I'm tired of books being banned. Trust me, your teen can find much worse stuff right on their smartphone. Just cause it's not your jam, don't rob others from access. 🏳️‍🌈📚\n\n #freespeech #bannedbooks #nobannedbooks #lgbtqbooks #fantasybooks #sexpositivity #sexpositiveculture #bookban #bookbanning #librarybooks #sarahjmaas #sarahjmaasbooks #genderqueerbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/282253592_3228262674116908_9129463426729823166_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=HyqqdStikZQAX_bGh_a&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDsUwq6jJUZtsc1ukkNo5QY3bwmPcqjq2ZxvYb16N864Q&oe=636E2C82&_nc_sid=76ac9f"},{"text":"I always have a hard time adjusting to graphic novels because I tend to skim the pictures to get on with the text. So much of creating a satisfying comic is about balance—the layout of a page, what portions of the story are told through drawings versus words—and I feel I’m not yet a good reader of the genre. I stumble over pages with an untrained eye, rereading captions and dialogue to compare them to the art. I try my best to synthesize the two mediums, but I always feel a step behind.\n\nI think this is how many cis people experience pronouns. The gender we were assigned at birth aligns with our feelings in the world, so we’ve never had to search for the balance that so often alludes people like Maia, people who feel as though they’re the lone occupant of a gender-binary seesaw. I won’t lie and say that I’m perfect all of the time, that I don’t stumble blindly around the binaries of my socialization, but reading books like Maia’s, witnessing eir point of view, sets me a little closer to the path I want to be on. \n\nI know the more graphic novels I read, the better I will become at reading them, just like the more I incorporate non-binary pronouns in my vocabulary, the more natural it will feel, and I can’t begin to fathom how good of a reader and speaker I would be if—like many kids before me—I’d grown up with my nose pressed in a comic book. And if this metaphor is getting to convoluted, let me just say this: it isn’t hard to meet someone where they are, to take the small weight of the body you carry everyday and set it at end of their seesaw, to offer the brief but sincere gesture of a he, she, e, ze, or they, and let someone know that you see them. That you care. \n\n#genderqueer #maiakobabe","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279290109_695192765133496_3880226236254216603_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=gTrsUT5-DscAX9mNbxw&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBfvNBfZ3cGL2ecAYJehRpDHoe6XNuNwTAyFQn0XbDmug&oe=636E9D2A&_nc_sid=76ac9f"},{"text":"Paperback library copy of Gender Queer by Maia Kobabe standing upright on top of a light wood bookcase. In the background there are leafy plants and the top row of books on the shelf are visible.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/278675189_2208006772695625_7692382388865397566_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=0GOEN_bY_oEAX-D1e7F&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfD_xvMLrrSyXSv402y2Ag2uG4LlAu7sILSgRMQ30k2Ygw&oe=636E0AC1&_nc_sid=76ac9f"},{"text":"Introducing the most dangerous book in America!\n\nThis week the SGN is reading the hotly discussed graphic novel Gender Queer. This autobiographical illustrated novel is full of heart, insight, and relatable candor. Follow along with Maia Kobabe as e explores growing up, gender identity, Queerness, and the importance of relationships of all kinds. This beautiful book is heartwarming and at times numerous, and the perfect read for anyone (young or old) who has found themselves searching for their place in the world. \n\n•••\n#lgbtqbooks #lgbtbooks #lgbtbook #lgbtbookstagram #lgbtbookclub #lgbtqbook #lgbtqbookstagram #lgbtqbookclub🌈 #lgbtqgraphicnovels #lgbtgraphicnovel #lesbian #gay #bi #bisexual #trans #transgender #queer #nonbinary #genderqueer #genderqueerbook #genderqueerpride #bisexualbooks #transgenderbooks #transgenderbook #transgenderbooksforchildren #queerbooks #queerbook #queerbookstagram #queerbookclub #nobannedbooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/278289630_506115057807049_1886534133892615773_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=ZzSUCZnLckYAX-OsIAJ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDVFZ_PofnDTc3GfHZjtKzu1eY39IHrZ5XrdXx0iA32RQ&oe=636ECC71&_nc_sid=76ac9f"},{"text":"Oh! How I love a memoir. \nI consider all reading a gift but reading memoir is an extra special one. I read a memoir and I can receive one of two gifts. I can see myself or parts of my own experience, joys, aches, or flaws reflected back at me—therefore receiving the gift of recognition, the gift of “you too? I’m not the only one?” Or I can read a memoir and see nothing of my lived experience. I can see a life different from mine but just as human—and what a precious opportunity that is. I feel privileged to read a person’s memoir and be gifted the chance to see their face. \n•\n•\n•\nMy preferred method of reading is physical paper copy but I had no such luxury for this book. The library system I work for decided to remove it from our physical collection after several members of the board made enough fuss about it. I do not know all the back and forth that transpired between board and administration before this call was made, but the decision stands that patrons cannot come into our building and check out this book. It no longer exists in our catalog. \nThis choice not only has ripple effects and casts a foreboding shadow on future collection challenges, but it has immediate effects for myself, as a library professional who believes a public library should reflect the entire public, and for my non-binary, gender queer, and trans friends and coworkers. Is the library a safe space for them when books that reflect and affirm their humanity are challenged and removed from circulation? \n•\n•\n•\nI don’t mean for this post to be a manifesto or a smear campaign. I hope I have expressed myself with respect to an organization that I hold in high regard but wholeheartedly disagree with on this case. \nI read this book months ago and I’m still thinking about it. I’m thinking how clever and revelatory Maia’s art and writing are. And I’m thinking of the board who read it and instead of seeing it as a gift and a chance to bear witness to an experience different from theirs, they decried it unfit for the public. And that breaks my heart. I want them to experience the gift.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/277839656_123412866941086_428019219296960713_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=wKbMhv9cmpAAX9RDkmX&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBYwJwPasb1yLdCQdrpniapnqk_p3Y7yKR4S9ksHVfEpA&oe=636F0B9C&_nc_sid=76ac9f"}]