[{"text":"Half of the Yellow Sun is set in 1970s Nigeria, balancing truth and fiction. Writer beautifully wrapped  a story of love, loyalty, betrayal, resilience and hope, in between the war. Through Adichie’s prose, we are offered a glimpse into the lives of several very different and multifaceted characters who are all determined to survive in the Free State of Biafra. This book gives voice to the survivors and causalities of the war. Half of a Yellow Sun provides the reader with an experience that humbles, informs, and ensures that such stories are not lost in history. It is a tale that eloquently demonstrates what it means to be human, to confront your own mortality, to fight for a cause, to be vulnerable, and to be at war with oneself in the midst of political turmoil.\n\n#booksbooksbooks #lovetoread📚#readingisfun #readingtime📖 #adichie #halfofayellowsunbook #readabook #bookstagram #booklover #words #readmorebooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/128761141_396642414719707_6336881049906840293_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=SeZ4NmBv-eoAX9wIMlS&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfABlCeZXdvkt38Cy2dYURJdOHYVEasCCald1ySRD_z-uA&oe=636F58FA&_nc_sid=76ac9f"},{"text":"//Half of a yellow sun by Chimamanda Ngozi Adichie\n\nStarvation was a Nigerian weapon of war. Starvation broke Biafra and bought Biafra fame and made Biafra last long as it did. Starvation made the people of the world take notice and sparked protests. Starvation made Zambia and Tanzania and Ivory Coast recognize Biafra. Starvation made parents all over the world tell their children to eat up. Starvation made the International Red Cross call Biafra its gravest emergency since the WW2.\n\nBefore getting into this book, I was oblivion to how the Nigerian civil war was fought, who Gowon and Ojukwu were, what Biafra was, and who Igbo, Yoruba, and Hausa tribe were. Upon entering into the well-crafted world of Adichie, I began to absorb like a sponge, too much at a time and giving little away. In the mornings, the sky was like a calm sea, by the evening, planes started flying low and fear spread throughout the body, red blood flowed across the streets, soldiers marched past and gently stroked the dead bodies to see if there was any life left. The half of a yellow sun glared from the torn sleeve of the soldier and later on the flag of Biafra. The only people left alive constantly muttered under their breath - \"If the sun refuses to rise we will make it rise\". Some knew they had to run before they're a dead piece. But, they couldn't muster the energy to move their scrawny hands and legs. They could only run and escape in their thoughts and pray to God to not be butchered in front of their family.\n\n“Red was the blood of the siblings massacred in the North, black was for mourning them, green was for the prosperity Biafra would have, and, finally, the half of a yellow sun stood for the glorious future.”\n\nBut war is not the only central theme here. With war, we have the story of a family, love, infidelity, friendship, and betrayal intersected in the lives of Ugwu, Olanna, and Richard. \n\n(continued in comments)\n\n🌿Which is your favourite book based in Africa?","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/152333718_3856669931063111_9082814121447748760_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=B4_bHlV73Q4AX_2OZrD&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCafWwRxtJNkRSynYcom9o34asl0OdEztVAZ8J2rMVIBg&oe=636DFFFD&_nc_sid=76ac9f"},{"text":"#photography #ghphotography #art #explore #exploreeverything #cinnamonrolls #tea #halfofayellowsunbook #benafbakes","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/142227325_1125399831249375_2933056989154965486_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=aulfOdlqeuoAX_SgNUb&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfD9Qqo_ucJp-gNZ3Z0LwcF0OVbmwRtLOBXWOZYLePuNnQ&oe=636FA25D&_nc_sid=76ac9f"},{"text":"This one has my soul ✨\nsuch a wonderful read. masterpiece, i must say.\nonly words i have is 'choose love love and love, always and life will follow'. they say love happens to us when we are living but the truth is life happens to us while we are loving. \n\na must read 🦋\n\nbooksbooksbooks #lovetoread📚#readingisfun #readingtime📖 #adichie #halfofayellowsunbook #readabook #bookstagram #booklover #words #readmorebooks #amancalledove📖 #absolutelove #40rulesoflove❤ #rumi #shamsoftabrizرح #sufi #lovereadingbooks❤️📚 #mustread","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/138410281_2725283401058010_3458951785812305890_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=fA01bhAaXo4AX9MjIZm&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB4qxPPKyJ5rnfnxeyZY7TZ34V1RJh0sqni8NwQFSAfLQ&oe=636F95EB&_nc_sid=76ac9f"},{"text":"Ahh ! \nA man called OVE ♥️\n\nThose who have read the book knows what 'a man called ove' is and they know he is LOVE 🍒\nOVE - 59 year old grumpy man. \nAt first, i found him very rude, arrogant man but soon i unraveled a different one and i started adoring him for what he really is. one, whose heart is wider than the sky, deeper than ocean and softer than flowers. \nToday, where love has been playing a secondary role, i found Ove giving the whole nostalgia about what the Love is, by loving his wife even after her demise, giving HOPE. \nThe character development is so strong, that i felt like hugging Ove and i really did hug the book. \nTrust me, it's the book, you need to pick, you will not regret. \nin today's world, we really need to be a man called OVE ! ♥️\n\n#booksbooksbooks #lovetoread📚#readingisfun #readingtime📖 #adichie #halfofayellowsunbook #readabook #bookstagram #booklover #words #readmorebooks #amancalledove📖 #absolutelove #amancalledove ♥️","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/128241418_657407178286871_5673143449571041723_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=kN8A7UGulGQAX_94UwR&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC9MfWetMn1KH047FmwlROVTYGXmrB1eIBzqmrBeTBYFA&oe=636E55F6&_nc_sid=76ac9f"},{"text":"\"How can the land belong to any of us? We belong to the land!\"\n\nWe all have heard or read or watched some of Ramayana, the story Maryada purushottam Ram - the epitome of perfection, and his struggle to revive Ayodhya its past glory. Well the book is sort of re-telling a previous classic. Indian Literature where classic mythological literature is held with the lens of modern world is fascinating as it gives us readers a new perspective about the whole thing. \n\n#readingtime #readabook #indianmythology #booksbooksbooks #lovetoread📚#readingisfun #readingtime📖 #adichie #halfofayellowsunbook #readabook #bookstagram #booklover #words #readmorebooks #ramayana #indianmythology #mahabharata #ramachandraseries #booksbooksbooks #ramachandraseries1","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/123142339_3990024781026246_4946857308281298434_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=BbNpCz6SH1wAX_gsdTL&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAVZWZdGmtaPdY2ZhcnZCu2suD-bND3L6rzBR0ph0zCvQ&oe=636F5EAE&_nc_sid=76ac9f"},{"text":"Sita : Warrior of Mithila is the second book of Ramachandra series authored by Amish Tripathi. The book was preceded by Scion of Ikshwaku and will be succeeded by Raavan: Orphan of Aryavarta.\n\nThis book is a retelling of Ramayana and narrates the various stage of Sita’s life. Unlike the usual portrayal of Lady Sita as a demure princess and faithful wife shown in Ramayana, Amish’s Sita is a fierce warrior, an able administrator and a master strategist throughout the book. The character of Sita portrayed is so inspiring. Sita, also known as Bhoomi as she was found in a furrow, grows up as a doting daughter of the royal couple – Queen Sunaina and King Janak. \nThe fluidity in storytelling and the brilliance of visualization urges the readers to explore the multi-dimensional life of Lady Sita through various perspectives relevant even to this day.\n\n#readingtime #readabook #indianmythology #booksbooksbooks #lovetoread📚#readingisfun #readingtime📖 #adichie #halfofayellowsunbook #readabook #bookstagram #booklover #words #readmorebooks #ramayana #indianmythology #mahabharata #ramachandraseries #booksbooksbooks #ramachandraseries1 #sita #ramachandraseries2","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/123480872_357917875473665_4657632927194501937_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=1z3KDqdQH2YAX_Nfvw_&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDVK_IlfKF3r4Moh64iUFzamQNVjOQAWQXW2M7eKtDkKg&oe=636F6129&_nc_sid=76ac9f"},{"text":"The third book of Ram Chandra series, Raavan: Enemy of Aryavarta, follows Raavan’s life, set in 3400 BC. A fierce warrior, brilliant scholar, ruthless businessman, powerful king, artist, musician and statesman all rolled into one, Raavan is known in mythology as the villain who kidnapped Sita, wife of mythical god Ram, in the epic Ramayana.\n\nWe have seen Raavan as a unidimensional villain but here I love the Villain of all time 🤗  The story Amish wrote is thought-provoking, particularly when it highlights problems such as the caste system, racism, patriarchal evils, poverty, addiction and child abuse.\n\nEven if you haven’t read the previous titles in the series, the disadvantage isn’t too great as they’re independent stories.\nPick it up and you won’t put it down.\n \n\n🍃🌾♥️\n\n \n#readingtime #readabook #indianmythology #booksbooksbooks #lovetoread📚#readingisfun #readingtime📖 #adichie #halfofayellowsunbook #readabook #bookstagram #booklover #words #readmorebooks #ramayana #indianmythology #mahabharata #ramachandraseries #booksbooksbooks #ramachandraseries1 #sita #ramachandraseries2 #ramchandraseriesbook3","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/123172269_273619287366798_6528408009553963272_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=t-hnJwizepIAX_b8eLt&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCnhh25VMnjn3PDOuZiJaqeohO7Xug3pNC2Ndp3jRSSAQ&oe=636E9918&_nc_sid=76ac9f"},{"text":"Because #booksasoutfits will always be a thing!\n\n@shobozil we love how you own your geek. It's so refreshing and generally fun to experience.\n\nThank you!\n\n#thegeekishshop #geekish #wedogeek #books #customerappreciation #geeksrus #currentread #halfofayellowsun #halfofayellowsunbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/117350303_916451228853843_7531245937911594935_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=MERSqW5MFcMAX9YRVYZ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBqkrnAk_xtdtZ40Lp-DFQSQ4T11Gph4XOIoxSVZjgEew&oe=636F5535&_nc_sid=76ac9f"},{"text":"On this episode of \"If you have watched the movies, read the books\" because the books are more touching 🥺. Another Chimamanda Ngozi Adichie classic.\n\nPrice - N4000\n\nCondition - New\n\nGenre - African Fiction, Historical Fiction \n\nAge range - Adult\n\nStockpiling available\n\nSend a DM or click the link in bio to buy\n\n#thethriftreader #thriftbookslagos #thriftbookstoreinlagos #booksinlagos #booksaboutwar #booksinnigeria #africanbooks #africanfiction #africanstorytelling #halfofayellowsunbook #lagosthriftbooks #lagosbookstore #lagosbookseller #lagosthriftbookstore #lagosthriftstore  #lagosnigeria #bookstoreinlagos #bookstoreinnigeria #bookstoreingbagada #nigerianfiction #basedonabook #booktofilm #igbohistory #biafranwar #bibliophile #onlinebookstorelagos #bookstagram #bookloversinlagos #bookloversinnigeria #africanclassics","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/304995121_407704424809174_4719929153816421803_n.webp?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=lqiNXhHRsFMAX-GvO40&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfA34eWUM27p9aNvybsDq8WHTVxShyamoIbkc7vcbMxz0A&oe=636E487D&_nc_sid=76ac9f"},{"text":"Half Of A Yellow Sun/Chimamanda Ngozi Adichie \n\nA strring heartbreaking account of the Nigerian Civil War as seen through the eyes of three very different characters , Ugwu, Olanna and Richard. \n\nUgwu, a thirteen-year-old houseboy who works for Odenigbo, a university professor full of revolutionary zeal. \n\nOlanna, the professor’s beautiful young mistress who has abandoned her life in Lagos for a dusty town and her lover’s charm .\n\n Richard, a shy young Englishman infatuated with Olanna’s willful twin sister Kainene.\n\nI particuarly liked that the characters were great and their transformations seemed genuine, the book felt authentic and was evocative, the transition from normalcy to chaos was done perfectly. Reading about Olanna and Odenigbo's relationship felt real and the tribulations in their relationships were not overplayed. \n\nI came into this book not knowing much about the Biafran Conflict and came out feeling as if i'd lived through the experince, the brutaal honesty layered with tangible and relatable characters made the book more visceral and heartfelt especially the last few pages.\n\nI'd absolutely reccommend this one.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/291758906_1003194097028509_1070219694968186746_n.webp?stp=dst-jpg_e35_s1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=bOLbDGaClW8AX9Su7Sb&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDmFz9PisVx3EnBJhF7Wv0qpIAk55qejGns4UrP0cl9PA&oe=636DDB2D&_nc_sid=76ac9f"},{"text":"🌸Mental Health Talk 2\n\nHalf of a Yellow Sun portrays how people react to traumatizing experiences in their lives, including seclusion, alcoholism and having nightmares. One thing I appreciate about this book is the fact that it portrays an imperfect family surrounded by perfect love. \n\nThe intense love between Olanna and Odenigbo helped them through the tough times. Even though they did not win the war, they were together through it all.  Love is the ultimate goal of life itself. To be born and share bonds of affection, to see our partners for who they are and choose to grow old with them, to see remorse and embrace them without a shadow of a doubt. Carrying each others burden with love so sincere. \n\nI have felt the butterflies in my tummy, giggled at his texts, lived for his calls and longed for his touch only to realize puppy love is for showbiz. It is not enough to love love but to live love. \n\nMy take-home from this masterpiece is that we all struggle, maybe not at the same levels. We need love to go through it all. We need to normalize talking about mental health. Perhaps it’s time to rediscover yourself with love.\n\nTo kiss in the rain\nTo walk in the mud \nTo hug under the sun\nTo cool under the moon\nTo love love \nTo live love \n\nTill next time Catie and Winnie🌸\n\n#mentalhealth #relationshipgoals #africanwriters #bookloverkenya #bookstanzania #chimamandangoziadichie #halfofayellowsunbook #flb_series","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/259862499_293601572659682_2963588808284037408_n.jpg?stp=c0.179.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=FNiJSmedKdIAX9xuA_Q&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC9ZTqTjVYbyMmDY-khDyhUsWbJjh2KznOYoE58Q1-eaA&oe=636EB886&_nc_sid=76ac9f"},{"text":"🌸 Mental Health Talk 1\n\nI dare say in Africa, mental health is a synonym for ungratefulness. The African society has reduced mental health to mere excuses for not acting as expected of you. The community will remind you to be content, that unlike some, you are a complete biological being not missing a limb or toe; how lucky can one be? Definitely, jamming of the mind like everything else is solved by a pot of chicken or palm wine. \nAs old and odd as that can be, I have no intention to awake our ancestors. They say, Let the bygones be bygones.\n\nI worry about every little thing. I struggle with insomnia, conversations in my sleep which I don’t remember a word the following day, self pep talks and the ‘I should haves’. Nobody knows the dark side of our lives. It is lonely in there. I face my fears and struggle to be free daily. It may be anxiety or depression, or maybe it’s just part of the journey. It is very easy for society to condemn you as a social or a self-absorbed person. Your family and acquaintances may never understand because no one can ever relate to your mental struggles. \n\nOne time I told my friend how I was struggling with anxiety and that I was praying for God’s grace. He quickly shunned me down and said that I couldn’t pray away what seemingly I had brought upon myself. So I shut my door, I pray a lot more for grace, and I promise you, it gets better every day. \n\nMental health is considered a taboo in most African societies. We do not talk about it even in our families. Neither schools nor churches teach about mental health. Our brains are the most essential part of our body but even getting to that therapist office is damn expensive. Recently, I took a journey to rediscover myself through other people’s stories. In this journey, I met master Odenigbo struggling with alcoholism after the death of his mother in the Biafra war. Olanna was traumatized, having seen many dead bodies, including that of her uncle and aunt. \n\nTo be continued…..\n\n#mentalhealth #relationshipgoals #africanwriters #bookloverkenya #bookstanzania #chimamandangoziadichie #halfofayellowsunbook #flb_series","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/260067515_920339012209995_3891536095145411076_n.jpg?stp=c0.172.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=1xEKEuJcG1EAX9lO6xQ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBTZaEQQ_nSMNNYIZjfff49MnvtF7bieXAA4A2XoxLiag&oe=636DF88A&_nc_sid=76ac9f"},{"text":"Hi there! \n\nIf you've still not read any of Chimamanda Adichie's book, then I highly recommend this one. Its an all time favourite. DM for a free copy of this Ebook\n\n#ebook #halfofayellowsun #books #bookstagrammer #bookclubofinstagram #bookclubgirls #bookclubsinnigeria #nigerianbookfestival #nigerianbooks #bookclubsng #booklove #bookoftheday #bookme #ebookreader #ebookwormsclub #ebookseries #halfofayellowsunbook #booksbooksbooks #bookshelf #bookshelves #blackbooksaremagic #nigerianbooklovers","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/253435490_126295646463063_1011309482021354965_n.jpg?stp=c0.78.624.624a_dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=3ItPuK_5ufYAX99gpPP&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCHRBBes0cXQEaWcxmmQB3-CWCBhFY11hfZQRNmEOuDeA&oe=636F27EF&_nc_sid=76ac9f"},{"text":"\"The real tragedy of our postcolonial world is not that the majority of people had no say in whether or not they wanted this new world; rather, it is that the majority have not been given the tools to negotiate this new world.\" - Chimamanda Ngozi Adichie, Half of a Yellow Sun \n\nThis historical fiction novel takes place prior and during the Nigerian Civil War (1967 -1970), also known as Nigerian-Biafran War or simply Biafran War. The ethnic, political and religious conflicts between the three dominant ethnic groups: Igbo, Yoruba and Hausa-Fulani fueled the war. It's a vividly haunting novel about postcolonialism, secession, morality, love, loyalty, betrayal, resilience and hope. \n\nThis is definitely one of my favorite reads this year! I highly recommend this book for anyone who wants to read historical fiction that are not set during WWII. \n\n#ReadsbyShaine #2021reads #chimamandangoziadichie #chimamanda #halfofayellowsun #halfofayellowsunbook #historicalfiction #historical #bookwormlife #bookstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/221780843_114489690912752_4628580560503387575_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=108&_nc_ohc=qEMjoqJkMXEAX_1VWu8&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfADW_tnZJt6bHG0aaK9uyzg3G1UuBeQAqSnC3DSWmG6UQ&oe=636E0E31&_nc_sid=76ac9f"},{"text":"#ThrowingBack to me smiling my widest whilst meeting my favourite writer, the @chimamanda_adichie in 2016.\n\n📸 : @akunnaonwu","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/157603941_2786310641623344_8189511092590429298_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=5ZjinPhu_rMAX9KqiYv&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAyKUIJ4RMpN1NMAGLU96MSctN5KyLKpBOHP7l59lEmAw&oe=636E126B&_nc_sid=76ac9f"},{"text":"#halfofayellowsunbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/121362868_124434192743949_2861143845881214653_n.jpg?stp=c236.0.608.608a_dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=MyWHjnpO-a4AX-eOC_2&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDcsiaFoM_w0xm3ONyJZQSUbH6e6QOQoHfL8ZcOaE4cMw&oe=636EF50A&_nc_sid=76ac9f"},{"text":"Title:Half of a yellow sun by chimamanda ngozi adichie\nPrice:15000/=\nPaperback\n\nNigeria became independent from Great Britain in 1960. The Nigerian-Biafran civil war lasted from 1967-1970 and was marked by extreme starvation and ethnic violence. Ethnic tensions fostered by the British played a major role in the war. The majority of eastern Nigeria, was comprised of Igbo peoples, and this area seceded to create Biafra.\n\nThe 'half of a yellow sun' is the symbol of the Republic of Biafra, appearing on both its national flag and military uniforms. This novel follows the course of the Nigerian-Biafran civil war through the experiences of the ethnically Igbo characters, Olanna, Odenigbo, Kainene, and Ugwu.\n\nHalf of a Yellow Sun is told in third person point of view in four parts. Each chapter marks a change in point of view, shifting between Ugwu, Olanna Ozobia, and Richard Churchill.\nTwin sisters (Thandie Newton, Anika Noni Rose) from a wealthy Nigerian family take wildly different paths in life, but both become swept up in the struggle to establish Biafra as an independent republic.\n#biafrawar #loveinwar #twosisters\n#halfofayellowsunmovie #halfofayellowsunbook#chimamandangoziadichie #booknerd#booklover#bookstagram #bestafricanfemalewriter","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/118519510_770457737120644_129269296002998558_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=sHylHNcFNUcAX_qJKCB&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBTedqIGKPD9YuqRDhx-FTqmNFGrEJsTSlBUMTpVoCNhA&oe=636E2017&_nc_sid=76ac9f"},{"text":"Virtual book club prep time. #bookclubquarantinestyle #virtualbookclub #bookclub #books #book #halfofayellowsunbook #research","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/91619157_542273189759767_97930196237278902_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=8oniIrZloVcAX8GpyWp&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBC_7qXHggV7erso_sW93zDdOsob0ZY6eUXYOHU63ppYQ&oe=636DDE2E&_nc_sid=76ac9f"},{"text":"Book of the Month: ‘Half of a Yellow Sun’ by Chimamanda Ngozi Adichie - A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.\n\nWith astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another.\n\nEpic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had. @chimamanda_adichie #halfofayellowsun #halfofayellowsunbook #chimamandangoziadichie #educateprivate #educate #bookstagram #bookofthemonth #books #lovebooks #nigeria #prizewinningbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/85173787_2523927324591414_2612965934826513343_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=RyKoWj32lGoAX-ki1_a&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB79B3sxfaTBxMItF32LQ1hCXo5raIWCqfBhU9zUWHygA&oe=636DD8B7&_nc_sid=76ac9f"},{"text":"The shop is open again, and I am processing a few stacks of new arrivals. Come see what's new for 2020 at Lewiston's best* bookstore!\n.\n. *only 😉","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/81026981_469799533719953_4246618716519103578_n.jpg?stp=c73.0.933.933a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=hkC1_Bw3nKgAX8uWNto&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAnCkf1tofVNIflhILD4wATP-S06mXH88is8w2lQVmYsw&oe=636EFAB2&_nc_sid=76ac9f"},{"text":"I will be writing a book review for Half of a Yellow Sun by Chimamanda Ngozi Adichie soon. Link will be in the bio, this book change the way I see things that I didn't understand. #halfofayellowsun #halfofayellowsunbook #halfofayellowsunbookreview #halfayellowsun","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/20067453_365106287238336_9200586668413812736_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=zXQrCYbVLOgAX8Q1Bzk&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAjT_Rmd82fYCNTL8782uT650nJ4-qODmwDYACpQ72Ypw&oe=636E5F7A&_nc_sid=76ac9f"},{"text":"🌺 #goodmorning #pistachio #nutella #cake #breakfast #chimamanda #halfofayellowsunbook 🌺 #happysaturday 🌟","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/1599845_243585939146466_1974086512_n.jpg?stp=dst-jpg_e15&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=jEenuLwuuu4AX9wHjYJ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCD_OYPBGJLPSPkW4M5jIbyDIkkatX2Mfmh-aEyThcKIA&oe=636E8718&_nc_sid=76ac9f"}]