[{"text":"✨Beyond Magenta - Banned Book review✨ 5⭐️\n.\nThis book was definitely my favorite of all the banned books I’ve read so far. Why? Because it is a biographical collection of kids telling their own stories about being transgender and their experiences growing up. As our understanding of biology, gender identity and sexuality has developed as a society, it has become clear that we still have a ton of work to do. Transgender children are facing horrors and abuses that are unacceptable and it something everyone should be working to change.\n✨\nIt is definitely heartbreaking to hear what these kids have gone through, yet their stories are insightful and powerful. These kids are bravely telling their stories even though we still haven’t created a world that properly recognizes our true biology of diversity, and the reality that gender identity and sexuality are spectrums not either/ors. That gives me a lot of hope for the future. The author did a great job collecting, telling, and also showing the lives of some very brave kids. \n.\nI recommend this book for everyone, because understanding others, empathizing with experiences that differ from our own, and creating a world that accepts a diversity that truly honors us  as people, is something we should be aiming for❤️ \n.\n.\n.\n.\n.\n.\n.\n#beyondmagenta #beyondmagentatransgenderteensspeakout #beyondmagentabook #transgender #bannedbooks #bannedbooksweek #bannedbookreader #bannedbookreview #bestreads #bestbooks #book #books #biographical #lgbtq #lgbtq🌈 #topteenbooks #igbooks #igbookreview #igbookstagram #igbookclub #instabook #instabooks  #instagrambooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/296371348_472999731497826_301277573877216874_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=5XRWFz6tb5EAX9ZMQR4&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAJA3gD9et94FEX3Bss9M1JYacqNrEOATVFXySEpkG3ag&oe=636F55F2&_nc_sid=76ac9f"},{"text":"⁠\nOur series continues today - original videos created by ⁠\n@ahml for #BannedBooksWeek focusing on the freedom to read and celebrating the personal stories of staff and community members, featuring the words of award-winning and significant authors, both past and present. ⁠\n⁠\nAHML Celebrates Banned Books Week: #LGBTQ+ ⁠\nWatch the next video at ⁠\nhttps://youtu.be/pakJZC83NcM⁠\n⁠\nBanned Books Week is an annual event organized by @americanlibraryassociation and national contributors & sponsors. ⁠\n⁠\n#BannedBooksWeek2020⁠\n#FreedomToRead⁠\n#IntellectualFreedom⁠\n#BeyondMagentaBook⁠\n#DramaBook #IAmJazzBook⁠\n#ALA #AmericanLibraryAssociation⁠\n#BannedAndChallengedBooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/120261447_334998404386142_4248402520358064366_n.jpg?stp=c315.0.810.810a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=Ap-GGImwKN8AX9_go_k&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB9kC_vyimE2Lp9PeM0nid_iN9pnJxRScsXxqojeopHww&oe=636F718D&_nc_sid=76ac9f"}]