[{"text":"El arte debe ser consumido y propagado. Aquí te recomendamos dos novelas, una de ellas gráfica, por si quieres pasar un rato contigo y escapar a otro mundo.\n.\nPAPI es una de las obras más conocidas de la autora dominicana Rita Indiana. Habla de la vida de un personaje tiránico de gran poder en su entorno vista a través de los ojos de su hija pequeña. Llora y ríe con esta novela que tiene una forma muy particular de ser contada.\n.\nFUN HOME es una novela gráfica en inglés de la autora Alison Bechdel, donde se tratan temas como la homosexualidad, el autodescubrimiento, la identidad y a como lidia una familia con el fallecimiento de un miembro.\n.\nDeja en los comentarios alguna novela que quieras recomendarnos.\n-\nEN UN TEMA APARTE: Un millón de gracias a todos los nuevos Patreones que han llegado en los últimos días, ustedes nos ayudan a seguir este proyecto con más ganas y con las energías de que hacemos lo correcto www.patreon.com/wilferland\n-\n📷 @roblesedward\n-\n#papi #ritaindiana #funhomebook #recomendaciones","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/67624364_511148929457328_7303918500641688227_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=q5vy9NFlsPoAX-ThqCv&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCFYPnf4qdI7Jf_sLj1LSjn-SytTpcpR6bslNPghqRTBw&oe=636E032A&_nc_sid=76ac9f"},{"text":"Fun Home: A Family Tragicomic by Alison Bechdel\n➡️➡️ swipe for @goodreads summary\n\nI rarely reread books, although I find that this is changing with age. Sometimes it’s nice to revisit something familiar and perhaps see it through different eyes depending on what has shifted in my own life. Do you reread books? If so, when and why?\n\nI’d been meaning to reread Fun Home for a while now, and Pride Month seemed as good a time as any to do so. Fun Home is a graphic memoir in which Bechdel grapples with her father’s death, recounts her own coming out story, and examines where and how these two threads overlap. The content is compelling in and of itself, but what makes this book so good is the way it is structured: instead of organizing her story chronologically, each chapter is thematically based on an allusion to a specific author or literary classic. This approach could easily come off as pretentious or ham-fisted but the execution is just… so expertly nuanced that the resulting effect is layers upon layers of reflection and a complex meditation on grief and connection and family and WHEW. Bechdel knows her craft. Check the trigger warnings for sure, but also please go read this RIGHT NOW. It’s that good.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n#FunHome #FunHomeBook #AlisonBechdel #GraphicMemoir #PrideMonth #QueerBooks #QueerAuthors #Bookstagram #BooksBooksBooks #BookWormLife #BookWorm #BookAddiction #ILoveBooks #ILoveToRead #Bibliophile","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/290590291_901883623944054_512468114371649892_n.jpg?stp=dst-jpg_e15_fr_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=UobaV1c3VWIAX9nPBRK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCMlD_rOvdVWdg0FTFQ1Ok2jefJOKv59AtbfbADLTJZwA&oe=636EAA4F&_nc_sid=76ac9f"},{"text":"Fun Home by Alison Bechdel @alisonbechdel \n👓\nThe subtitle ‘A Family Tragicomic’ is a perfectly accurate way to describe this graphic memoir. The author tells stories about her father’s life and their relationship via parallels to famous works of fiction that were important to either or both of them. Both father and daughter are queer and the way that’s played out throughout their lives is unusual, but that plus the father’s death make for a really compelling story. It’s clear that its fewish words are remarkably carefully chosen- many sentences and captions with several meanings. The illustrations were really good; they added clever/funny/telling details. Maybe because I haven’t read many of the works/authors referenced, or maybe it was the non sequential timeline, but I was a bit lost at times. I’d recommend this to people who love memoirs, lgbtquia+ literature, and dark humor. (Spoiler: the titular ‘fun home’ is actually a funeral home!)\n👓\nEven though the dads are very different, the dad from the picture book Gator Dad is also pretty eclectic. Gator Dad, like Fun Home, also has terrific illustrations that really add to the story! \n👓\n#funhome #graphicmemoir #graphicnovels #whatiread #funhomebook #alisonbechdel #momswhoread #pridemonthbooks #tragicomedy #readersofinsta #june2022 #atozreadingchallenge #readallthebooks #readlgbtqauthors #summerreads","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/287713733_139641785334112_6173495222065041061_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=muf8vWrb97sAX8rkq0h&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAjo9nN7ZkMtZa0TkL5g4n0kDmz4CLhixrnLvZb2Wp0RQ&oe=636F7129&_nc_sid=76ac9f"},{"text":"I don't usually read graphic novels, but I really liked this one! It was a memoir of the author that told the story of her grieving process after she lost her father, their relationship while she grew up, and the way she wanted to be closer to him. It was really interesting because her father was a very complex character and the author and her father mirrored each other in a lot of ways. There were surface level things they had in common like their struggles with their sexuality and nonconformity to gender roles, but there were deeper things that also made them mirrors of each other. The book also showed her father in roles that we don't see men in a whole lot, like on one page when he was nurturing. It was an engaging coming of age story that took us on a journey with Bechdel! The book gave a lot of insight into her internal struggles, and I appreciate how Bechdel was willing to be so vulnerable. While I read it, I could emphasize with her easily, that's how good she was at writing herself as a character, which I know from experience is nit an easy thing to do! Even though the author and I had very different families and childhoods, this book was still really touching and impactful, I actually cried at the end! \n\n#funhome \n#funhomebook \n#funhomegraphicnovel \n#alisonbechdel \n#bookstagram\n#bookblogger \n#booksbooksbooks📚 \n#booksbooksandmorebooks \n#graphicnovels \n#insightfulbooks \n#impactfulreads","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/217634898_655678552501681_5058272009748243353_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=GO4TDvkNMkUAX_NVyKt&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCnKvW9RmQv_L9t90JSHjjgdd8V0UtQ_BFgSyphwmETIg&oe=636DE5E9&_nc_sid=76ac9f"},{"text":"Quando tutti dormono ed è solo il rumore del condizionatore a farti compagnia.... e le pareti colorate sembrano fare capolino come animati tessuti pronti ad avvolgerti in un abbraccio per farti accomodare a leggere... Here we are! #funhomeunatragicommediafamiliare #funhome #funhomebook #books #instabook #bookstagram #ilovereading #nuoveletture","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/64869920_358667694677817_8280474994020721895_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=gyPczrwbtTwAX_ofIJS&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCHbvIpEEr7pQA2OmGsALPBspXi6z8nM9NDudBqjgdxfQ&oe=636EA9DE&_nc_sid=76ac9f"},{"text":"Finished. And mentally destroyed a little bit. \n#funhome #funhomebook #funhomethemusical #allisonbechdel #book #musical #lgbt #lesbian #family #tragicomic","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/10401831_881538448632877_1579709022_n.jpg?stp=c0.117.937.937a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=1MJYNM6Ri3wAX_sMKzy&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAyGjFbFT4YN44l6aThr2Y-wKjL20wm6-f_G8NueSOi-Q&oe=636F0EC5&_nc_sid=76ac9f"},{"text":"Um dos meus livros do ano é uma HQ estadunidense publicada originalmente em 2006. Que livro, gente! #alisonbechdel #funhomebook #livros #book","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/124277987_706691616939639_742445919738878936_n.jpg?stp=c0.70.566.566a_dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=gwqNsFCsA-0AX_y29Nb&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC_Fma0RD3v86yKOI0CX1Z4wVZPJu-IBHdgUFzbKGZSYQ&oe=636E45FA&_nc_sid=76ac9f"},{"text":"#funhome #awesomepresent #funhomebook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/12716626_1303906316291830_1676597509_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=I29l81hSFkgAX_emwd4&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDVx639Jgqcz-F3M30cOiDvZGg-DFBNWdwn9SFMQbcKWQ&oe=636DE08A&_nc_sid=76ac9f"},{"text":"It’s Banned Books Week! This week I’ll be featuring a handful of my favorite banned books from recent years. While this week is a great opportunity to highlight the classics that have been banned over the years, I think it’s also important to note that censorship is not a thing of the past. This week’s books will all be releases from the last twenty years. 📚📚📚\nAlison Bechdel’s first graphic memoir focuses on her tumultuous relationship with her father. It grapples with the homophobia, mental health, and suicide, as well as complicated family dynamics and the pervasive repressive culture of some areas of Bechdel’s hometown rural Pennsylvania. It’s an incredible and heartbreaking story, accompanied by Bechdel’s masterful drawings. I wish I had more Bechdel in my life. Does anyone have any similar books to recommend? .\n.\n.\n.\nDress: Calvin Klein","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/41144305_301426504012743_8209571686095030004_n.jpg?stp=c0.135.1080.1080a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=2oYSsT11tH4AX_38Qv8&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBkjqsCPp9DUyMYwl3xswnUSmKxFzGMTlFgLj4I_26MAA&oe=636E2277&_nc_sid=76ac9f"},{"text":"Are You My Mother? by Alison Bechdel: After reading Fun Home, I thought I’d read Bechdel’s second memoir! I quite enjoyed Fun Home, but I can’t quite say the same about Are You My Mother?. I wasn’t as invested in this one as I was with Fun Home, and I overall didn’t like it as much and it took me way too long to get through. There are many similarities between the two, but there are many differences as well. Like Fun Home, this one is very honest and personal, and feels almost like a conversation. However, this one feels more external and more like a memoir, with the reader looking into Bechdel’s life. Whereas Fun Home had more of a plot and linear story structure that was easier to follow and felt more like a novel. On a similar note, a lot of the content of this one focused on Fun Home and how she wrote it. In terms of the art style, it’s slightly different and is visually darker. Also, while the main colour scheme of Fun Home is green, the main colour scheme of Are You My Mother? is red. I find it interesting that she’s chosen to use contrasting colours, perhaps to contrast her relationships with her father and mother. Overall, it was a good book and I appreciate it for what it is, but I didn’t enjoy reading it very much. ⭐️⭐️⭐️\nDates read: ~ February 8th - March 15th 2022\nReading length: ~ 6 weeks\n•\n•\n•\n#book #books #greatbook #bookrecommendations #ireccomend #ratreads #bookreview #bookstagram #bookstagrammer #bookish #bibliophile #instabooks #igreads #igbooks #funhome #alisonbechdel #funhomebook #funhomememoir #alisonbechdelfunhome #funhomealisonbechdel #areyoumymother #areyoumymotheralisonbechdel #alisonbechdelareyoumymother","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/278145838_159673566463282_5172365323040140618_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=M82wFSZjzFQAX_k5enK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfA2ZmAZJkkYuTuRgcmcYtMY88AN99ATI1jePDwMVaR-yw&oe=636E405D&_nc_sid=76ac9f"},{"text":"Fun Home by Alison Bechdel: I had been wanting to read this for a while, so I’m glad I finally got around to it! I had seen this book in my high school library and had heard about it and its corresponding musical, but hadn’t read it. It eventually got weeded from the library, so I bought my own copy and just got around to it! Overall, I liked it a lot. The narrative is smooth and almost conversational, and I like this. It’s well written and well drawn. The art style is really cool too; it’s a neat mixture of cartoony and realistic. It’s very honest, and there were a lot of aspects I could relate too. There’s a lot of heavy content, including depictions and discussions of sexuality, identity, family, mental health, and more. The characters are complex and messy, but that’s one of the things that makes them so captivating. There are also a lot of literary references which I thought was neat. Overall, I liked it a lot. ⭐️⭐️⭐️⭐️⭐️ ~Danica\nReading length:\nDates read: Jan 28 - Feb 7 2022\n•\n•\n•#book #books #greatbook #bookrecommendations #ireccomend #ratreads #bookreview #bookstagram #bookstagrammer #bookish #bibliophile #instabooks #igreads #igbooks  #funhome #alisonbechdel #funhomebook #funhomememoir #alisonbechdelfunhome #funhomealisonbechdel","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/275013842_355139796327036_1142768970411271342_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=hraLogJDSBsAX9Aoe7H&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBq2F8tUy4JoL99qMLeVRJpsg3fpDc8aGrEjS7DvANmaA&oe=636E8A23&_nc_sid=76ac9f"},{"text":"Critically acclaimed lesbian cartoonist @alisonbechdel is best known for her 2006 graphic memoir Fun Home, which later became a Tony award-winning musical, @funhomemusical. Both Fun Home and Bechdel’s second graphic memoir Are You My Mother? are deeply vulnerable works in which she explores her relationships with her family, her romantic relationships, coming out, and more.\n\nNow, the MacArthur Foundation “Genius Grant” recipient talked with LGBTQ Nation about her new graphic memoir, her first since 2012.\n\nThe Secret to Superhuman Strength, out May 4, is another examination of Bechdel’s life, this time told through the lens of her lifelong obsession with exercise.\n\nLink to read more in @creagercole_pr bio. \nBy @mollysp for @lgbtqnation\n📸 @elenaseibertphotog\n\n#alisonbechdel #funhome #funhomebook #funhomebroadway #areyoumymother #thesecrettosuperhumastrength #gaybookstagram #lgbtqwriter #lgbtqauthor\n#lesbianwriter #lesbianauthor #queerbooks #lesbianauthors #lesbianwriters #lesbianwritersofinstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/182907505_1402105300149375_7535339474494327452_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=i0LRkAJlW30AX-n9eKY&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBalHr2CabAuAoY3pg9hwGvuSB3PqxFBrOg3xLXIdjbHQ&oe=636E5780&_nc_sid=76ac9f"},{"text":"i love the musical/book fun home, it’s amazing. ALSO you guys should check out this new broadway podcast that is going to start up soon. they already have a bunch of people signed on to do it. highly recommend, i already know it’s gonna be awesome. i tagged them in the post, so if you like musicals, give the account a follow","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/26072302_2013361802284763_5376590625506328576_n.jpg?stp=c0.27.1080.1080a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=Ksd2cXirfSsAX9oETzy&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB4s_yAP0xrhh1TcXg1aAP-cyikufa8ls8_HGty-ec0bw&oe=636EAA28&_nc_sid=76ac9f"},{"text":"\"- Puis vint la substance invisible en suspension dans les entrées, dont je compris bien vite qu'elle flottait comme des tentures entre tous les objets. De #funhomebook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/15624083_1572707362758602_2192352698894909440_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=iAfKgubtCqsAX9IbJuB&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCscQUX8rslZVxbJKtwwyzhI47sIAvjY6y0bLzIFdqqPg&oe=636F9D69&_nc_sid=76ac9f"},{"text":"*LOOKIT WHAT I FOUND!! 😱\n~\n*I've already read some of it and it's pretty good!\n~\n*I's happys now!\n~\n~\n*#funhome #alisonbechdel #comic #book #funhomebook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/13413313_573477952813267_2098948361_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=DEaW2-i9JGsAX8GryIm&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBNF5vWmfajfEdQKfpMfoxJw1JWX1HZItwnKm-E2YU0rg&oe=636EE10A&_nc_sid=76ac9f"}]