[{"text":"Girl, woman, other! Reveiw. \nRating: ☆☆☆☆\n*I realy enjoyed this but it was a bit tricky to read: throughout the entire novel there was non full stops and the language/themes was definitly mature. It was a great insight into the lives of black woman, throughout different generations and of different sexual identities. I enjoyed the perspective slightly more with some characters and my fav sections were latisha and megan/morgan. It was so clever how all the lives intersect. \nWould recomend! \n\n#girlwomanother #girlwomanotherbook #books \n#bookstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/260246017_117537917402214_1370300797891911933_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=JIsc3rA0vxsAX_uVCqL&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAYyue2GzE8YNxCHHCJlYvF3rCx2-WNxrWYcHJMBCwqEQ&oe=636DDC52&_nc_sid=76ac9f"},{"text":"Hi hi hi lovelies! 😘 \n\nI don’t really have a title for this list cause it’s more of a pandering, floopy conversation type post!\n\nDo you guys ever buy a book but then never really want to read it? Because I know I wouldn’t have bought this if I didn’t like the sound of it but I have absolutely no desire to read it and it nearly bothers me a little seeing it in my shelf. Do you guys get like that sometimes?\n\nBut my reader heart doesn’t want to get rid of it in case it’s an amazing book and I miss out by not reading it but I don’t want to look at it on my shelf if I won’t read it and I don’t overly want to read it but I must’ve bought it for a reason. Ya know? \n\nLol I feel like this is really weird and other people don’t feel like this at all! \n\nHave any of you read this? Want did you think? Because I think it even won an award so it should be good.\n\nHappy Reading ❤️ \n.\n.\n.\n.\n.\n#booksta #bookish #bookstagram #bookstagramuk #bookstagramni #bookstagrammer #bookstagrammeruk #bookstagrammerni #book #books #yellowbooks #girlwomanother #girlwomanotherbernadineevaristo #girlwomanotherbook #booklover #bookrecommendations #booknerd #bookishlove #bookpost #bookishpost #bookphotography #bookishphotography #bookconservation #bookcommunity #bookishcommunity","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/289000929_512647333943499_4827569164473555771_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=jRuD7cT6PD8AX9Bxayi&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAfyMsvkXMTWxR_yv6bvcu3PTdSE15BZ4MHC4bGXL8_7g&oe=636E4FC4&_nc_sid=76ac9f"},{"text":"A cosy afternoon well spent. Reading is my absolute favourite thing to do in lockdown, and it’s such a great feeling when you find a book that you honestly can’t put down. Especially in the midst of a pandemic, turning to books can be a great escape. \n\nI still have no idea why it took me so long to get around to this one, even though its been sitting on my bookshelf for ages! \n\nWhat can I possibly say about this brilliant novel that hasn’t already been said? \n\nWell, I found it very moving and  decided to post a short review up on my website anyway. \n\nTap the link in my bio if you’d like to know more about Girl, Woman, Other.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n#girlwomanother #todaysreading #lockdownreading #lockdownlife #reading #goodreads #bookstagram #bookrecs #bookstagrammer #bookreviews #bookreviewer #penguinbooks #girlwomanotherbook #bookerprize19 #booksofig #bookramblingsbyolivia","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/135506023_224241749173165_888721344878333973_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=vzxSLidoAxIAX9ftqY7&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBzAFzaHXL_-qd7XkVNhSVXHAa3P_WB_kkKpUgVLJjECQ&oe=636F4FAD&_nc_sid=76ac9f"},{"text":"Winsome\n\"Winsome is preparing a family favorite of roast breadfruit, fried flying  fish seasoned with onion and thyme, with a side of grilled yellow squash,  egglplant, zucchini and pan roasted mushrooms with a herb lemon sauce.  As the sea air breezes into the kitchen window through the mosquito mesh that stops the flies invading in the daytime. She appreciates healthy eating now. She is back home in Barbados and eating food grown in her vegetable garden and fish caught fresh. \n\nHer daughter Shirley is complaining about her terrible job in that terrible school in England and when Winsome advises her to leave the school, Shirley replies I don't sugesstions Mum, I just want you to listen. \n\nWinsome takes the fish out of the fridge, scales, fillets and slices it with her sharpest knife, runs it under the cold water, dips it in vinegar. She makes a marinade out of myrtle pepper, garlic, corriander, thyme and oil in a bowl, coats the fish, wraps in foil and puts it in the fridge.\"\n\nAn exerpt from \"Girl, Woman, Other \" by @bernardineevaristo \n.\n.\n.\n.\n#Bookreview #bookblogger #lonerreads #bookstagramfrance #bookstagrammers #bookstagram #livresaddict #livres #girlwomanotherbook #bookerprize2019 #literature #booksinspire #booksinpictures #penguinbooks #penguinvintage #penguinuk #bernardineevaristo #bookstoreadnow #bestbooks2021 #blackauthors #blackhistory #readingaddict #readingiseducational #alwaysreading #summertimereadingtime","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/235949817_536565990993968_5496369967414495695_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=108&_nc_ohc=NxtDCV2OhsIAX8D7sFw&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfASfrsmo1PJMtbhTKG0mjbTFtFdfq2VQPLKauRxaOcKnQ&oe=636E5E19&_nc_sid=76ac9f"},{"text":"Enjoying a slow Sunday morning before returning to a (slightly) more normal routine of working from home tomorrow. \n\nWhat can I possibly say about this brilliant novel that hasn’t already been said? \n\nAll I know is I’m loving it so far and it feels like the perfect book to kick off the New Year with. \n\nIn Girl, Woman, Other the interconnected stories of a group of black British women raise timeless questions about feminism and race. The characters are so vivid and the writing is beautiful. It’s taken me way too long to finally read this book so I knew I absolutely had to bump it up to the very top of my 2021 TBR! No regrets there. \n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n#girlwomanother #bookerprize2019 #bookerprizewinner #bernardineevaristo #penguinbooks #girlwomanotherbernadineevaristo #girlwomanotherbook #currentlyreading #reading #cosy #home #stayhomesavelives #stayhomestaysafe #stayhomereadbooks #bibliophile #bookstagram #bookstagrammer #slowliving #slowsundays #home #cosy #bookrecs #bookreviews #bookblogger #coffee #coffeeandbooks #coffeeathome #bedroomreading #cosy #comfycosy #winter #januarymornings #bookramblingsbyolivia","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/135651803_244271020395802_4726082251876574033_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=hlkBOC_KWtUAX_0uG67&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfArXwi_J7zQPxWRGiGaXIqCIDWF-1wC5kliMr-25TBJhA&oe=636EC135&_nc_sid=76ac9f"},{"text":"Girl, woman and others \nO livro conta a história de 12 mulheres negras na Inglaterra, entre lutas e alegrias, elas tem de alguma forma suas vidas interligadas. Personagens diferentes, com ambições diferentes, vivendo em épocas diferentes, mas como batalhas semelhantes: os desafios de viver dentro de uma sociedade racista e patriarcal, um elo que une muitas de nós. São mulheres comuns, com dilemas que parecem atemporais, histórias onde reconhecemos tias, mães, amigas, nós mesmas. Um misto de atualidade e passado, a beleza de uma colcha de retalho diversa, colorida e única. 📚📖#girlwomanotherbernadineevaristo #girlwomanotherbook #girlwomanother","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/94631893_574071016558571_2667561526137081634_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=nmJTP6xjoRwAX_oKGIz&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBUyj3Zbw_0ZkDzkwQEBzXxatuXLxPg0S0T0Fwa-7gE7Q&oe=636F5A80&_nc_sid=76ac9f"},{"text":"Spring Break left me with a lot of reading time, so here’s some mini reviews of everything I read!\n\n🚢👩🏼 The Unsinkable Greta James by Jennifer E Smith- I really liked this one! It was a quick read with short chapters, and I really got lost in the Alaskan scenery. There could have been more character development for sure as some parts felt rushed but overall I thought it was a fun, quick read.\n\n👩🏾‍❤️‍💋‍👨🏼🏡 Act Your Age, Eve Brown by Talia Hibbert- I absolutely loved this book! It’s the third in the Brown Sisters trilogy, and it did not disappoint. All the characters were great, and I felt were all developed really well. This was my favorite book of the three for sure.\n\n⛲️🤫 The Fountains of Silence by Ruta Sepetys- This is an author that does not waste a word. AFOS was slower paced than some of her other books, but I honestly didn’t mind it. There were so many perspectives, and such a detailed and rich history of Spain during the dictatorship of Franco. Highly recommend for any historical fiction readers.\n\n👧🏾🌌 Amari and the Night Brothers by B.B. Alston- This was so fun! I started it on a whim after reading some heavier books and it was the right move. The characters are great, the plot is great, the twists and turns are also great, and honestly I forgot this was a middle grade book. Looking forward to Book 2!\n\n👧🏾👩🏾 Girl, Woman, Other by Bernardine Evaristo- I loved the style of this. It contained many interconnected stories based on a single character, who would have appeared in other chapters. I personally like this as it adds a new dimension to the stories being told. There is a bit of a non-traditional writing style, but it works to keep the reader’s attention. That being said, it is slow-paced and reflective, and I found myself putting it down and picking it up over the three weeks that I read it. \n\n🌃🔍 City of Glass by Cassandra Clare (reread)- I have way more questions than I do answers. All I need to say is Clary just needs to stop making out with people that could *potentially* be her brothers.\n\nHave you read any of these?","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/277035467_495464048730897_5888108382006533925_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=pYUWjvBfXwQAX9dLjBO&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDneJE58UeGWoDmPhosPzDJUuZZgVhirpaRle72U8SBOA&oe=636ED5F2&_nc_sid=76ac9f"},{"text":"-girl, woman, other by Bernardine Evaristo-\n\nwow what can i say about this book that has not already been said. i found it really amazing, informative and compelling! i love the books that follow characters through their whole life, and this one follows 12 women with different sexualities, racial backgrounds and generations.  the writing style can be a bit hard to get into because of the sentence formation. sometimes it reads like poetry and/or non-fiction but i personally really liked it. all the narratives were very interesting and i found myself immersed in this book throughout. \n\nwhat did you think of it if you've read it?","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/153018913_280100517053386_956615152133237615_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=itsj0P_tKnEAX-xVb0z&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBtfII3noinRLyJ0So9WLmoRsX_9kenSVGBA9MCJ7jhqQ&oe=636EA7FE&_nc_sid=76ac9f"},{"text":"Hello #instateaders 📖..\nWhat’s up ! Hope it’s getting better no matter what’s going on ! You know #covid20 is all over the news and #socialmedia .. \n.\n.\n#qotd🦄 by #DEC. what is the least thing you can think of that you want to happen ? \n.\n.\nFor me I would love that I can be and my family safe and healthy as it can be .. \n.\n.\n.\n#lastpurchase #newbooks📚 #bookishthoughtsy #bookbooksbooks #booksandcoffee☕️ #girlwomanotherbook #askagainyes #booksphotography📸","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/132089694_2121424057988152_4288035069431464507_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=DoqMeTFW5WQAX-z-708&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfC1inPklbA7ulRlkq-2f2xLGtsuQIlAEU1GNneBpLYdDA&oe=636EAFFC&_nc_sid=76ac9f"},{"text":"Teeming with life and crackling with energy — a love song to modern Britain and black womanhood, Girl, Woman, Other follows the lives and struggles of twelve very different characters. Mostly women, black and British, they tell the stories of their families, friends and lovers, across the country and through the years.\n\nJoyfully polyphonic and vibrantly contemporary, this is a gloriously new kind of history, this winner of The Booker prize 2019 is a novel of our times: celebratory, ever-dynamic and utterly irresistible. \n\n.\n.\n.\nOrder via DM or visit us to get your hands on this book.\n\nDM for any enquiry.\n\nFollow @fewabookshop to find your new favourite reads.\n.\n.\n.\n.\n.\ntags: #fewabooks #book #books #bookstagram #bookstagrammer #booksbooksbooks #reader #readingculture #readerpokhara #bibilophilenepal #bibilophile #bookaddict #booksaddict #bookstagramnepal \n#booklover #booknerd #booksnepal #bookspokhara #bookstorenepal #bookstorepokhara #bookerprize #bookerprize2019 #girlwomanother #girlwomanotherbernadineevaristo #bernadineevaristo #bernadineevaristowriter #girlwomanotherbook #tbr #storiesofwomen #womensprizeforfiction","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/274600485_674450880536949_5090468320062878663_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=OukuYleYsY0AX_LAHdk&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDTYt30r51-zNaOfVEa5WeUGKZwKYLQU832pWPB45uyzw&oe=636F14D8&_nc_sid=76ac9f"},{"text":"📚Girl, Woman, Other - Bernadine Evaristo📚\n•\n\nSummary: This book tells the life stories of a group of black women, all connected in some way. We read of their early life, right up to the present day and all the each have overcame and accomplished in between \n•\n\nReview: I didn’t really like this book at all! I do appreciate the story it was trying to tell but I have to say I found it long, drawn out and hard to follow. With that said, I have to say I did like the ending \n•\n\nRating: 3️⃣/🔟\n\n#girlwomanotherbook #bernadineevaristoauthor #bookclub #bookreview #bookstagrammer \n\n**Ps. All reviews are my personal opinion, this not mean you will like/dislike the books etc**","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/273017800_1404260393365960_5700467931509851175_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=475k-iz6IacAX80MXBX&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAyYmi7PqCgESHvk93qn8lXJB5LqBJDUURFq0yrgLrLaQ&oe=636EC6C9&_nc_sid=76ac9f"},{"text":"I consider this shelf my ‘recommended reads’ shelf - if anyone in my life ever asks to borrow a book, I’ll look here first. Do you recognise any you’d recommend or want to read?\n\nIs it weird to have to stack my books in rows? Sadly I don’t have the space to put every book spine on show (I know some of you will cringe at the bent copy of ‘Normal People’ front and centre - my apologies!). Now and again I’ll swap them around so they all get their share of the limelight. ✨🤩💫","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/269752405_944891576156970_2082578789589948207_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=rBS71keDwSIAX8BknCn&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAIPTyju-Rayf1G6uhvb1RzH-MoqEy0pzBG4sLKUn3JCg&oe=636E27FC&_nc_sid=76ac9f"},{"text":"Yes friends #bernardineevaristo 's #girlwomanother book is now on our ebay store🥳😊\n.\nFREE shipping!✅\nFor many more beautiful books and products, you can visit our store link in the bio and shop.☺️🤗\n.\n.\n.\n.\n#girlwomanother #girlwomanotherbernadineevaristo #bookstagram #bernardineevaristo  #bernadineevaristowriter #bernadineevaristoauthor #woman #grill #ebayseller #ebaystore #ebaysales #book #bookphotography #readabookday #reading #bookinfantil #girlwomanotherbook #uk #unitedkingdom #bookbloggersofig #ebayuk #booking #bookuk #englishbooks #ebaylife","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/200896456_878697372996723_5878621485354544517_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=e8FmEMIdwpUAX_F990V&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfA1rETW7dj89NgHybkXni4JtyIQdo5bGVQJ4U_8CduG7w&oe=636EA37E&_nc_sid=76ac9f"},{"text":"Girl, Woman, Other \n\nI mainly got this to see what all the fuss was about, I've seen it all over bookstagram. So, naturally, when I saw it on the english shelf at work (I work in a bookstore) I got it.\nAnd waow did I love it. At first I was a little bit unsure about the form. It's a lyrical roman. But I easily adjusted to it and found it quite charming. \n\nIt felt amazing to read a book revolving women and a non-binary person. And especially POC women and a non-binary. And lesbians! \n\nEvery chapter, or whatever I should call it, represent one person and we get to see how all their stories intertwine in the end pretty much.\nI did find the intertwining part a little bit disappointing. The epilogue I found amazing when it connected dots, but the last chapter \"After party\" was very meh compared to all the amazing stories I had read before. I wish more would have happened. But I think the epilogue weighed it up. \n\nI do think it deserves all the love it has gotten. It was an amazing read. \n\n#girlwomanother #girlwomanotherbook #bernardineevaristo #book #books #booksta #reading #bookworm #booksbooksbooks #reader #reading2021 #readersofinstagram #booklover #booknerd #bookstagrammer #bookaholic #coverart\n#literature #novel #booksofinstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/177708617_3954328671288577_7246370522396125716_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=kTImCmfdoUkAX9wkwf9&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBkGke5WnRX_dD-gL56QAgTsfAD1jZryM0mWSn4lsXKzQ&oe=636EB64B&_nc_sid=76ac9f"},{"text":":: New ::\nGirl, Woman, Other - Bernadine Evaristo\n\nOri ✅\nEnglish ✅\nSealed ✅\n180K ❌ ALL SOLD ❌\n\nAvailable on Tokopedia and Shopee, ada banyak pilihan ekspedisi di sana. \n\n#girlwomanother\n#bernadineevaristo #girlwomanotherbook #jualbukusecond\n#jualbukuimport\n#mocoimpor\n#moconew\n#jualbukusecond\n#jualbukuimport\n#prelovedbooksjakarta\n#novelsecond\n#bukubekas\n#igreads\n#instareader\n#instareading\n#bookstagram\n#bookstagramindo\n#booksofinstagram\n#literacy\n#bookreview\n#instabooks\n#weekendread\n#readerofinstagram\n#bookish\n#bookworm\n#bibliophile\n#booklover","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/176260493_750459869169914_3828363332069611203_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=FSMM0WDulTwAX9xiupk&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB4VgMAdqSi6QhBSqU-y_mi16YGZbQ0f8njXtJvKnpCmQ&oe=636EB085&_nc_sid=76ac9f"},{"text":"The perfect novel for International Women’s Day 🌈\n\nThere just is so much to be celebrated in Evaristo's irresistible GIRL, WOMAN, OTHER, a novel that not only captures the inner lives of women with astonishing specificity, but does so with poise and panache. While each chapter carefully constructs the totality of twelve individuals, Evaristo masterfully threads them together and in doing so, crafts a unified community of mothers and daughters grappling with life and love. Despite its massive concept, Evaristo breezily shows just how talented she is, free-flowing with ease and lyricism. She even manages to subtly shift her voice depending on which character's story she is telling, a nuance that truly lifts each character off the page.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/158436191_1803938999787112_3855140629764403556_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=BHU8nZDaUF4AX-BDIxc&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAsgQFuKG7DMO5iX-JPrT57SuxfuVN7YFkW5jLC-uTB6A&oe=636DE2F5&_nc_sid=76ac9f"},{"text":"Girl, Woman, Other 📚\n \nI feel like I cannot give this book enough credit. It deserves so much. Each character is important, difficult, flawed, intriguing.\n \nTo quote myself: Evaristo employs her characters to think freely, and say things that perhaps are hard to hear, or disagree with your own philosophies, but that’s what makes it so interesting. \nWe aren’t in an echo-chamber of likeminded individuals.\nWe are in a world, much like our own, where everyone is different, and everyone has their own opinions. A world where everyone is just trying to survive.\n \nFind my full review on my blog now. The link is in my bio 🔗\n \nGirl, Woman, Other:⭐️⭐️⭐️⭐️⭐️","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/143638807_249582909908906_3068829343273336644_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=XUYEjgJKA2oAX_qdzTS&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDtJmBpcBbkMJDjpuuxANxieT5an9E-7ib4-hYfpqAejQ&oe=636E0EB4&_nc_sid=76ac9f"},{"text":"A copy of Girl, Woman, Other is face up on a stripey background","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/141056954_247963083514152_7478515128244028316_n.jpg?stp=c2.0.823.823a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=QFK4XT0ov3YAX_yOBrr&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCa0vgpDl2mM-meiFurNkThF3LqC9UlUCLzxfKZLlV42A&oe=636DBE6B&_nc_sid=76ac9f"},{"text":"I may be behind the trends and a little late to the party but absolutely loving my #currentread Girl, Woman, Other. This book is definitely worth all the hype.\n.\nWhat I find most fascinating is how the definition of feminism is so different for each women cross generations and circumstance. The author has portrayed such a diverse range of voices and mores in such a compelling and empathetic way.\n.\nThis is my first Bernadine Evaristo book. I’m curious to know - Have you read any of her other works?","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/136996590_856820838385683_2945903607713921702_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=f7qkLKRhpDIAX9ggu0o&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDyL64WGJvwMDMW_hPZhIm0cvpkmj2HGc6KZeoxXl7Ixw&oe=636E2AFF&_nc_sid=76ac9f"},{"text":"An iron strong start to 2021 with this amazing novel, 'Girl, Woman, Other' by @bernardineevaristo bought as a Christmas present from my boyfriend.\n\nI was absolutely captivated by each one of the 12 women's stories and I wished for each chapter to be longer. They were strong women who survived and thrived despite their unique circumstances. I loved the intimate and honest glimpse in the window of each of these complex women's lives. They felt real!\n\nThese are exactly the 3D women with dreams and flaws and secrets I have been dying to read! I loved how they all connected in some way. No woman is an island. \n\nThis novel explores themes of grandmothers, mothers and daughters. Art. Aging. Abusive relationships. Friendship. Careers and fame. The importance of education. Cultural and historical ties to family. Racism, sexism, classism. Love. \n\nStories and characters I've NEVER seen before in a novel. Even some Geordies 🙌 It really covers it all. \n\nBuyyyyy this book. It might take a few pages to really get into. You will NOT regret finishing.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/135656911_217307073279544_4631255444332036591_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=CQYGuIQ0cvgAX_tH60s&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAcpxsljYl9YZuF3aYBG1duenE2oP3vMJzkPNPkoblCAw&oe=636E2087&_nc_sid=76ac9f"},{"text":"'Girl, Woman, Other is about struggle, but it is also about love, joy and imagination' Guardian\n\n'Evaristo's prose hums with life... At turns funny and sad, tender and true, this book deserves to win awards' Red\n\n'Masterful... Achoral love song to black womanhood in modern Great Britain' Elle\n\nGirl, Woman, Other follows the lives and struggles of twelve very different characters. Mostly women, black and British, they tell the stories of their families, friends and lovers, across the country and through the years.\n\nJoyfully polyphonic and vibrantly contemporary, this is a gloriously new kind of history, a novel of our times: celebratory, ever-dynamic and utterly irresistible.\n\n'If you don't yet know her work, you should - she says things about modern Britain that no one else does' Maggie Gee, Guardian\n\nWINNER OF THE BOOKER PRIZE 2019\n\nSHORTLISTED FOR THE GORDON BURN PRIZE 2019\n.\n.\n.\n#girlwomanother #girlwomanotherbook #bernardineevaristo #bernardineevaristobooks ##prizewinning #mustread #girlwoman #feminism #sexuality #identity #literature #bookgirl #books #bookstagram #bookerprize #Contemporaryliterature #Domesticfiction #domesticfictionbook #bookblogger #puneinstagrammers #puneinstabloggers #readers #readersofinstagram #booknerd #bookworm #pageturnr","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/131914686_1549237855274289_2103382691708014268_n.jpg?stp=c0.6.1080.1080a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=zLaZw4tFFfUAX8qG5yQ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCrlp_G2Tw2keynnaUpEeDmdk37KF9oj23cw7cwnXe80Q&oe=636FA6CF&_nc_sid=76ac9f"},{"text":"Loved Portrait Artist of the Year tonight featuring author Bernardine Evaristo & some pretty awesome hanging book decorations. Such diversity in art & depth in books. Have just purchased Girl, Woman, Other which was the 2019 Booker prize winner by Bernardine ~ we’ll let you know what we think,\nwatch this space! \n\n@bernardineevaristo #author #girlwomanother #girlwomanotherbook #portraitartistoftheyear #portraitartistoftheyear2020 #portraitartisoftheweek #paotw #paoty\n#blackheathbooksandbubbles #books #bookclub #reading #morethanabookclub #wecare #blackheath #se3 #knowledgeispower #booksofinstagram #booklover #booksbooksbooks #bookclubofinstagram #bookclubreads #lovebooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/130898544_1332178197133869_5005567415056294095_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=1uwjVFmvO-8AX8xCTfZ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAh7iIM41N-Mq1Ahh7kn219nTz2iS7VjcfOqnqLDbSR1Q&oe=636EB59F&_nc_sid=76ac9f"},{"text":"👩🏽‍🦱👱🏽‍♀️ Book experience 👵🏾🧕🏼\n\n#qotd: How was your weekend ?\n\nI finished Girl, Woman, Other and gearing up for a very busy week ahead . \n\nNow about the book ~~>\nLet me begin by saying that this is the kind of fiction I have been craving for, since a long time. This booker prize winner ticks a lot of boxes in terms of what fiction of modern age should be like . Don’t we all really crave for books where LBBTQ is no more a genre and women are ambitious not just in non fictions, where caste and race is a topic but only in the background . I feel books like these is the need of the day. \n\nThis book is a story of 12 characters , mostly women , black and British . I found it very modern because of the fact that it does not marginalise Gays and lesbians to only sexual desires and does not limit women to their issues of being a female. It goes beyond that , it highlights their life , as humans , with careers, struggles, achievements, aspirations and desires and so much more . \nAll the characters are strong and flawed in their own unique ways .They are so brilliantly portrayed that I became a part part of each story and I loved that about the book . Every character was far from cliched portrayals and absolutely charming because of their originality.I felt I needed so much more of each character , I was kind of left craving for more every time a chapter ended.I adored how stories seeped into each other just enough to weave everything together. \n\nThe writing style is being loved by so many and I absolutely get it . It made it so much easier to read as if it was flowing but I am a big sucker for beautifully written prose, well articulated sentences and carefully chosen words ,so I was not such a big fan . Although it dint bother me at all after first few pages. \n\nOverall , I feel this is a must read for everybody, it might change your perspective on a lot many aspects of society as it did for me .","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/119779000_179748700347378_5424233216024022661_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=iPeqH6m8B80AX-0miF3&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDx_gHPmAJBzgOYibySsbT_6_lvmegVA3l1Qb73_JS-Ew&oe=636E0203&_nc_sid=76ac9f"},{"text":"What's your next read?\n#girlwomanother #girlwomanotherbernadineevaristo #girlwomanotherbernardineevaristo #girlwomanotherbook #bernadineevaristo #bookstagrammer #bookstagram #booksofinstagram #fictionbooks #contemporaryfiction #amreadingcontemporary #ireadcontemporary #contemporarybooks #youngadultcontemporary #ireadyoungadultbooks #ireadyabooks #bookstacks #booksbooksbooks #booksandflowers #booksandcake #ireadfiction #ireadwithmydog #ireadyalit #bookerprize #newbooks #amreadingfiction","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/119467508_656436501949983_6465186337546286989_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=D1sZogIKSVMAX-alOqK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDbmVOuJloKBEwoAEz2wm-rHqA_5L2Vhgz-8IINnOukQQ&oe=636DFCCE&_nc_sid=76ac9f"},{"text":"The book ‘Girl, Woman, Other’ by Bernardine Everisto on a grey woven blanket with orange fabric behind the top left corner and bottom right corner of the book.","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/118768300_194478875356194_3465799106910368723_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=LB2DtyuIz5MAX_8eKkV&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBlS1_F_k0ya7lM4gOgUudeP9eyXhFxI5FrTB0g6EMrJw&oe=636DEC95&_nc_sid=76ac9f"},{"text":"... excited to get into these, at some point 🤷🏻‍♀️ #somanybookssolittletime ...\n٠\n▸ Read any of these yet? Heard such rave reviews on Girl, Woman, Other so I might start with that one first.\n٠\n▸ Hope you’re all enjoying your Sunday! \n٠\n٠\n#girlwomanotherbook #girlwomanotherbernardineevaristo #dominicanaangiecruz #jazzmounttbr #relaxedsundaymorning #tbrpile #jazzbdaybookhaul #bookstagram #bookstagrammer #booknerd #bookaddict #booklover #somanybooksmoment #idratherbereading #readerforlife #readeverydayeverywhere #booksarelife #bookcommunity #bookphotography #bookaesthetic #booksofinstagram #slowreader","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/105943091_190373675750383_2160672605908983101_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=0yi8kn-YgPQAX-2OVQJ&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCrHgxqmyhfrn7gJi6dt9GYh4IwJjZRG1ihtx3RJWqd0Q&oe=636E98F1&_nc_sid=76ac9f"},{"text":"i actually read this a while ago, but never got round to writing about it.\n⠀⠀⠀\nI loved this, so much so, I miss the characters and would have happily continued to learn and listen about their lives as part of my daily to do.\n⠀⠀⠀\nIt’s a powerful, honest and witty ‘deep dive’ into the successes, obstacles and prejudices that the 12 protagonists’ face.\n⠀⠀⠀\nIt offers a multi perspective vision on race, sexuality and what it means to be a womxn today, as well as a pulled back view on ‘Britishness’. How interesting it was to read such differing opinions, reactions and thoughts, on some fundamentally similar experiences.\n⠀⠀⠀\nI highly recommend this.. I feel like I came out of it with 12 friends, of whom I would like an update on, in the near future.\n⠀⠀⠀\nOh, there are no full stops. You forget about this about 15 pages in. Do we need full stops?\n⠀⠀⠀\n#booksofinstagram #bookstagram #igreads #books #bookreview #manbooker #manbookerprize #booksofinstagram #bookstagram #igreads #books #bookreview #brogansbookshelf #bookshelf #books #reading #novel #novels #bios #biographys #featured #recommendation #Bernardineevaristo #Girlwomanother #girlwomanotherbook #girlwomanotherbernadineevaristo #bernardineevaristowriter","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/104198334_298626831272585_5834996318225811519_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=Fj37UMTJdM0AX8dMyNM&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBtJOIKNy2m6K4AIjRleNfm5DLrTgPOW4NybR_s3z0m2Q&oe=636F3B63&_nc_sid=76ac9f"},{"text":"Girl, Woman, Other by Bernardine Evaristo ⭐️⭐️⭐️⭐️⭐️ (5/5)\n.\n.\n.\nJust finished reading this yesterday and wow 😍 I absolutely adored this book. It is about 12 different characters and how they lives subsequently intertwine. It focusses on the black community and rightly so, as it made me realise that I can’t remember a time I read a novel involving black characters, I tend to read novels that are predominantly centred around white individuals. Therefore, I aim to diversify my reading going forward ⬇️\n.\n.\nThe story is beautiful written and I admit I had to google several words or phrases to understand their meaning, such as ‘Mandem’ meaning group of men. So I feel it has educated me in some way. It does cover some sensitive topics relating to sexual abuse, which I feel may be a trigger for some❗️❗️❗️\n.\n.\nI admit at first I found the book hard to follow as it’s nearly void of punctuation with line breaks that seemed random at first, I found my self rereading sentences, but once you become familiar with the structure you don’t notice it. I also found the line breaks were not so much random but were to add emphasis to certain words. Anyone agree❓\n.\n.\nThe (happyish) ending, depends how you look at it, made me feel emotional and I put the book down feeling in awe. So much so, I immediately searched for novels by the same author, they are now on my wish list 🥰\n.\n.\n#bookstagram #booklover #booklove #girlwomanother #girlwomanotherbernadineevaristo  #girlwomanotherbook #blacklivesmatter #bookishcommunity","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/103824996_259181865366188_2555563650251880219_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=108&_nc_ohc=Y2qRzQTVmRkAX_sjtQ1&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfD4_rOXVPOlh77xEGKndIATUlLvsXYpbu6nfzkbz59Z6A&oe=636EEA42&_nc_sid=76ac9f"},{"text":"I never knew that I didn’t know. I am humbled. I always thought I was pretty well educated about racism, but I’ve learned I really have a lot to learn. So I will.\n\nThis past week I learned about “Girl, Woman, Other” by @bernardineevaristowriter from some of my UK book buddies. They recommended books by Black authors that discuss the challenges facing Black women from all walks of life. A winner of the 2019 Booker Prize (shared with Margaret Atwood) this novel follows the lives of 12 British Black women from age 19 to 93. Their stories intertwine and talk of their successes and failures, racism and assimilation.\n\nI am looking forward to reading this novel, and more, and sharing my thoughts as well as, most important, continuing my growth.\n\n#girlwomanother #girlwonanotherbook #bernadineevaristo #bernadineevaristowriter #girlwomanother #blackauthorsmatter #womenauthors #educateyourself #girlwomanotherbook bookstagram #reading #bookishladiesread #booksharks #dramafreenerdigans  #bookpals📚#ownvoice2020commitment","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/101554551_155546686032088_453540676912624917_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=_50PJQzmDVcAX_Gr5pV&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAi2-hdc_gQIZst3WvAI8lwhBoKhUDPjLCKwCQdUyub3A&oe=636E1590&_nc_sid=76ac9f"},{"text":"A rare beauty of a book that captures snapshots of predominantly Black, female-identifying characters, spanning across several decades and continents, creating an intricate web of interlinked lives.\nThe kind of novel that leaves you seeing the world and the people in it differently imo - couldn’t recommend more, ideally with an ice cold G&T in hand.\n\n#bernardineevaristo #girlwomanother #girlwomanotherbook #whatireadnext #quarantinereads #bookclub #booksofinstagram #lockdownbooks #whatimreading #whattoread","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/97200689_3188220254535665_954131491918732393_n.jpg?stp=c0.36.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=105&_nc_ohc=LihzQdQ2rBYAX-ndWiM&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBXo1am3HmX2pQkAmiFPCFmXAIQ2oZE6mUnJF6cFDltPw&oe=636EE138&_nc_sid=76ac9f"},{"text":"I have never read a book without Punctuation (more like punctuated with space). I didn’t even know something like that existed. The spaces achieve the desired result of emphasising on certain words or sentences, quite effectively . \nWoman. Black. Sapphic - Sexism. Racism. Added dose of Heterosexism along with the other two.  It’s a collection of  interlinked short stories, of mostly black women and their ‘British experience’. It’s a feminist narrative of the challenges, the struggles, the stigma of surviving and living in a white patriarchal, hierarchical conservative society. Such stories need to be written and read many times over. It covers many social issues like feminism, racism, homophobia, sexual orientation, gender identity (including identifying with none), alternative life choices, gender roles, domestic violence, gaslighting, child abuse, rape, stereotypes, single motherhood, the belief that marriage and motherhood make a woman complete, babymothers, and the many forms that discrimination and exploitation take on. .. It gives a deeper understanding of the  people that make up the LGBT community, especially trans people and  non binary people, and successfully sensitises you. A much needed discourse in this day and age.\n\nI really enjoyed this unconventional, poetic and colloquial style of writing. It’s humorous, sarcastic, sensitive, contemporary, progressive. A brilliant piece of work, a must read. #bernardineevaristo #girlwomanotherbook #fictionbooks #delhibookstafam #bookstagram #bookstagramfeature #africanliterature  #bookreviews #bookworm #booklover #winnerbookerprize2019 #mybookfeatures #quarantinereads #bookcommunity #lgbtfiction #feministfiction #bookaddict #ilovereading #africanauthors @womensprize #bookstagramindia #indianreaders #womenauthors @bernardineevaristo","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/92956174_1635290026623801_8976825754410487531_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=vHylkhCENRgAX8tkvH1&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAGVto8y8lmswOgho5TtOddEz0twHVl0t_039aTawozYQ&oe=636E911C&_nc_sid=76ac9f"},{"text":"🦋Girl, Woman, Other by Bernardine Evaristo🦋\n\nRATING: 🦋🦋🦋🦋 🦋/ 5\n\nTHOUGHTS: \nI often find myself unable to connect to UK black writers because of their inability to speak about intersectionality in a way that is parallel to my American experience. I gave it a chance last year when I read “Queenie”, but I was totally disappointed. Queenie is a book that although written by a black woman, it was intended for a different audience. I was skeptical of giving this book a chance due to the fear of it committing the same fallacy but I was wrong.\n:\n\nGirl, Woman, Other by Bernardine Evaristo follows 12(11+ 1 non-binary) British black women whose narratives are interwoven. This collection of stories is rich and represents the complexities of being a black woman. The best part of this book is how fully fledged each one of these characters is. Every one of their stories could stand alone and be it’s own book. I connected with each of these entities despite the flaws that many of them possessed. I rated this book a 5/5 because it was truly a masterpiece and totally deserving of the Booker Prize last year. :\n\nIf you enjoyed “Homegoing,” you’ll truly love these intergenerational personal stories that tackle important issues such as racism, sexism, sexuality, classicism, gender identity, etc. Have you read this book? Who’s your favorite character!? I personally loved Dominique and Carole’s stories. Chapter 3 was just complete foolery 🥴. :\n\n#girlwomanother #bernardineevaristo #bernardineevaristowriter #girlwomanotherbernadineevaristo #girlwomanotherbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/83207048_140625120801361_7026105117944532738_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=o5B0aq3RDtUAX9bKUrE&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBMtVeqSbIqQyH1tvztjM4R4yM1eHFynIhIxeiGHoU4jQ&oe=636DD46E&_nc_sid=76ac9f"}]