[{"text":"\"Girls are 50% of the population. We deserve to represent 50% of the heroes.\"\n♀️\nQOTD: Favourite woman author? Favourite woman character?\n♀️\nToday is international women's day! Who better to celebrate as a stand in for women everywhere than Tamora Pierce?! She writes a diverse set of characters and includes trans and gay women, Women of Colour, women from different classes, and women with different personalities and abilities. Tamora Pierce is an amazing woman herself too!\n♀️\nShe's the first author I remember reading who discussed a girl getting her period, something that's still fairly taboo in YA and junior writing and this book was from the 1980s! In more recent books, she's featured a trans Woman of Colour in a prominent role, a first for teen me as well! She's pushed boundaries since she was first writing Alanna and every series since has been more progressive and inclusive and that's something I'm proud of her for! Her newest series features a PoC as the protagonist and I can't wait to see what boundaries she pushes and issues she brings up in Tempests and Slaughter!\n♀️\n\"Men don't think any differently from women - they just make more noise about being able to.\"\n♀️\nCustom candles of Beka and Kel come from @lunalovebycorinna and checking out Corinna's shop is the best decision you can make today.\n♀️\n#tamorapierce #protectorofthesmall #firsttest #pagebook #page #squire #ladyknight #bekacooper #terrierbook #bloodhoundbook #bloodhound #mastiff #mastiffbook #rebakahcooper #provostsdog #provostsdog #tortall #alannathelioness #wildmagic #wildmage #yafantasy #internationalwomensday #weneeddiversebooks #lgbtinclusive #favouritebooks #middleearthmarch","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/28436476_907578602753092_6164214759177584640_n.jpg?stp=c107.0.865.865a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=WDFwfvpgD9oAX8Rwr4a&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDGFGQTUok84Kl--w0mR7HeT_1HO79s0tzwXSDUIol8Vg&oe=636EF4C7&_nc_sid=76ac9f"},{"text":"Y'all. I know it's going to sound silly, but I have been SOOOO worried about him not being #big enough. 😳 He's been underweight according to some charts I've found in my #mastiffbook (don't think I don't have one 😏) & I've been pretty upset that he isn't #growing 🙄 I am so glad I thought to snap this last picture tonight (which wasn't easy, btw) after bath time. 🛁 I am definitely not so worried now. 🤗😬🐶❤️💪🏻#vegasnesmith #englishmastiff #mastiffsofinstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/12725035_194530457582152_1676715847_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=GnfP7OU1WlUAX9BHJUO&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCXiWo9jVI1JIUVWGaNazOUabvf3zFimToZKqLWsFGXJg&oe=636E7894&_nc_sid=76ac9f"},{"text":"Took a break yesterday after the show.. I have loved reading tamora pierce's book for a long time, I almost have all of them! For sure all of the Tortall books. So there's my update folks, I'm getting back to new trippies today..have a good one! \n#tamorapierce #mastiffbook #book #bookedlol #diy #art #beads","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/17077270_219039595237531_803865131594285056_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=_utAiORJ4iQAX-nVjMK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB8cTfCuDTR3rVGxQ18rgWvDEn-_hk7riY2HHoDbs2MVw&oe=636E8F00&_nc_sid=76ac9f"},{"text":"#SockSunday is -- feet down -- my favourite instagram hashtag 😉 my giveaway ended yesterday night so expect the results over the next few days. I'm probably going to announce the first two today and the other three tomorrow! 😃 so make sure to leave your posts up until all FIVE winners have been selected and contacted. \nI am on the tail end of Mastiff, the final book in the Beka Cooper trilogy by Tamora Pierce. My favourite fictional cat is Pounce, Beka's companion in this series. He speaks to her in her mind and can vanish and reappear wherever he pleases! 🐱 he kind of reminds me of the sass in sassy attitude of Jiji from Kiki's Delivery Service! \nWho is your favourite fictional cat? \nI'm also going to include this post as the #atww8kpridegiveaway because this book has gender fluid, lesbian, and gay representation! I love the characters Okha (who sings in drag and describes himself as shifting from man to woman) and his long time partner Nester. They are the most adorable couple and I love the way Tamora Pierce used a fantasy world to talk about LGBTQA+ issues and stories. While Tamora Pierce isn't (as far as she has publicly said) LGBT, she has always been vocal about acceptance and expression of individuality. \n#terrier #terrierbook #bloodhound #bloodhoundbook #mastiff #mastiffbook #tamorapierce #ya #youngadult #yafiction #yafantasy #teenfiction #teenreads #ireadya #bookstagram #bibliophile #mustreads #favouritebooks #summerreads #series #tortall #bekacooper #fantasy #highfantasy #provostsdog #provostsguard","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/20065605_1964893733730563_1620160890680639488_n.jpg?stp=c202.0.675.675a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=SmEev9kE_RYAX-usZdV&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDdpcud7QYIlvYB_ySB3xFClc7o4oASmaI-S4LImSs9KQ&oe=636E63E9&_nc_sid=76ac9f"},{"text":"#bookloversapril17 Day 29: Book Stack\nI just got some new candles and they smell like pine trees!🌲 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * \n#terrier #bloodhound #mastiff #bekacooper #tamorapierce","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/18253189_417311441957603_1040658880624852992_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=OraWAfX__MoAX_MhcDo&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDy6f7mlORzBfF-Pad5-MefB7FxyelH_WWqqEKK4Sec2g&oe=636F5E3D&_nc_sid=76ac9f"}]