[{"text":"📚Book Tour & Book Review📚\n\nQOTD: What’s your favorite musical group/artist? \n\nThank you to @turnthepagetours & @simonteen for this copy of Bright by Jessica Jung! I have a giveaway up for this on my blog, link in my linktree. \n\nSYNOPSIS:\nThe sequel to the instant New York Times bestseller Shine! \nCrazy Rich Asians meets Gossip Girl in this knockout series from Jessica Jung, K-pop legend, fashion icon, and founder of the international luxury brand, Blanc & Eclare.\n\nCouture gowns, press parties, international travel. Rachel Kim is at the top of her game. Girls Forever is now the number-one K-pop group in the world, and her fame skyrockets after her viral airport styling attracts the attention of fashion’s biggest names. Her life’s a swirl of technicolor glamour and adoring fans. Rachel can’t imagine shining any brighter.\nThe only thing that’s missing is love—but Rachel’s determined to follow the rules. In her world, falling in love can cost you everything.\nEnter Alex. When Rachel literally falls head over designer heels into his lap on a crowded metro, she’s tempted to give up her anti-love vows. Alex is more than just heart-stopping dimples and adorably quirky banter. He believes in Rachel’s future—both in music and in fashion.\nBut the higher you rise, the farther you have to fall. And when a shocking act of betrayal shatters her world, Rachel must finally listen to her heart.\n\nMy Review:\n4/5 ⭐️ \nI really enjoyed this book just as much as Shine. I was a little confused at first over the 5 year time jump, but I loved seeing Rachel 5 years in the future. This definitely kept my attention, and I loved the romance, drama, and intrigue! The petty drama within this group… Wow. But if you love Kpop I highly suggest you read these books, I do wonder how much is based off of Jessica’s own experience! Maybe she will share that one day.\n\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung #abookishdream #bookstagramgiveaway #bookgiveaway #giveaway #bookstagram #bookish #booksta #bookstagramfeature #bookishfeature #bookstafeature #bookstagrammer #booknerdigans #bookaesthetic #bookgram #booklove #bookcommunity #booktography #booksonbooks #ireadya","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279444677_166023509193812_8126943294792038226_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=108&_nc_ohc=lD9emS4sdi8AX__A3Rd&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfD-8A_VMKlRpb-8XRK6hc6RUUtPPUCKiM0dAdk4NSGS9A&oe=636F13D7&_nc_sid=76ac9f"},{"text":"Favorite read of April? \n\nTo me, April simultaneously flew by and dragged. The last few weeks felt like months, but April as a whole feels like a blink. That might partly be helped by the fact that my reading was soooooo slow. With AP exams and tests, I spent way too much time studying, and nowhere near enough time reading. \n\nBut now, I can get back to reading!! Took my environmental science exam on Tuesday, and my English one today. My brain is dead, and I can't write for the life of me, but I did it!! Don't have to study anymore, I can dive right back into reading! \n\nSo of course, the first thing I did after getting home today was binge Bright. It was so adorable! The perfect read for a brain-dead binge, it was sheer fluff and fun. It was exactly what I needed after a long day :D \n\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung\n#bookstagram #bookstagrammer #smallfavors #thehoneys #springstack #booklove #standalone #spring #pastels #books #flatlay #cottagecore #flowercrown #reader #bookaesthetic #yabooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279814358_547132890174925_7170874011238255174_n.webp?stp=c240.0.960.960a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=Be1GQLAtIEAAX81LvBK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCBo-eoj20FgwlrN4JRMgzPu8wc3nDwqvEZ-wa4V6SczQ&oe=636F18C4&_nc_sid=76ac9f"},{"text":"🌱…\n-\n#outie #book #bookaesthetic #converseallstar #goodvibes #flowers #shinebook ##jessicajung #sky #sunest #tree #clouds #army #ａｅｓｔｈｅｔｉｃ #aesthetic #out #outfit #🌿 #reading","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/285032922_1237539887052789_5025612185207247955_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=1zRaoGXmHz0AX9gGu13&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDKd1akU2FfO3D5nXpDAf5efSRmgHNg_J-vH-T-3JKpAw&oe=636E5C7B&_nc_sid=76ac9f"},{"text":"⭐️GIVEAWAY⭐️\nWelcome to my stop on @TurnthePageTours’ release tour for Bright by @jessica.syj!  In honor of this fun sequel, I will be sharing my review and details on how you can win your very own copy of both Bright and Shine!\n\nHow to win your own copy of Shine and Bright by Jessica Jung\n\n-To enter to win a copy of Shine and Bright, head over to my blog post (link in my bio) to fill out the super easy Rafflecopter form! -That’s all it takes, and you’ll be entered to win!\n-Disclaimer: This giveaway is being run through Turn the Page Tours and @simonteen, and is not affiliated with Instagram.\n\nAs someone who is largely unfamiliar with the world of K-Pop, I was a little nervous about starting to read Shine, as I was worried that I would be lost.  Fortunately, this was not at all the case!  Jessica Jung pulled me into the world of K-Pop seamlessly, providing context when necessary and allowing me to focus on the story rather than on the unfamiliarity of the world. I loved the characters, the drama, and the high stakes that come along with fame.  I was especially a fan of how the romance between Rachel and Alex was written in Bright.  Their connection felt believable and relatable, even if their circumstances are a bit different than my own.\n\nMy Recommendation- \nWhether or not you listen to a lot of K-Pop, Shine and Bright are both such engaging and fun reads!  I would especially recommend this book to people who enjoy reading about life in the spotlight, and the challenges that come along with being in the public eye!\n\n#TurnThePageTours #BRIGHTTour #ShineBook #BrightBook #JessicaJung #KPop #KPopBooks #YaBooks #YaBookstagram #BookBirthday #BookTour #BookBlog #BlogTour #BookGiveaway #FreeBooks #Giveaway #Bookish #NewBook #Reading #Read #BookWorm #ContemporaryBooks #FunBooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279768224_2283666361774784_4943113775363512423_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=108&_nc_ohc=fnrBPkHDsPQAX8qP16R&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfD30qFr-sHhQjGqfB-egkbHSHVUnJ7nFvYIOZpgHXNHuw&oe=636F6114&_nc_sid=76ac9f"},{"text":"Are you a fan of K-pop fiction or books about bands? I definitely am! \n\nThank you so much to @turnthepagetours and @simonandschuster for providing an ARC and finished copy of Bright (Shine#2) by Jessica Jung. In my Linktreee, You’ll find three awesome links to check out:\n\n1. A blog post for a full review with @MidwestKimchi\n\n2. The Spotify playlist we made for Bright\n\n3. And, a giveaway! There is one (1) set of both books: Shine & Bright available. \n\n#turnthepagetours @turnthepagetours #simonteen @simonteen #BRIGHTtour #Shinebook #Brightbook #jessicajung #bookrecommendations #readabook #allidoisread #bookjunkie #bookishcommunity #booklife #booknerd #bookshelf #princessreadsalot #midwestkimchi","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279641106_369139111839510_2983947409009406368_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=igHTPxJno0IAX89YKqT&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDBFrrMBe6M2pDRNtf5TVNyfy1g213Wg4vIxEhk1RiS_g&oe=636E7228&_nc_sid=76ac9f"},{"text":"Are you into K-pop? I’m not great at keeping up with new music and bands, but it felt impossible not to eventually get caught up in K-pop somehow. It was admittedly the K-pop fans, their enthusiasm, and the way they banded together to protest that caught my attention more than the music. But I’m slowly listening to more and more. \n🌟\nI dipped my toe into this scene far too late to recognize who Jessica Jung is (K-pop legend and former lead singer of the girl group Girls Generation from 2007-2014) but I always find it really intriguing when people write about something they are intimately familiar with. (I admittedly picked up Bill Clinton’s presidential thriller because I was just too curious what a former president would write about in a fiction book about a president). I’ve always thought it would be cool to be a talented and famous singer and I’m eager to find some interviews by Jessica Jung to see in what ways her career influenced her book, and to dive into it!\n🌟\nSynopsis: \nWhat would you give for a chance to live your dreams? For seventeen-year-old Korean American Rachel Kim, the answer is almost everything. Six years ago, she was recruited by DB Entertainment—one of Seoul’s largest K-pop labels, known for churning out some of the world’s most popular stars. The rules are simple: Train 24/7. Be perfect. Don’t date. Easy right? Not so much. As the dark scandals of an industry bent on controlling and commodifying beautiful girls begin to bubble up, Rachel wonders if she’s strong enough to be a winner, or if she’ll end up crushed… Especially when she begins to develop feelings for K-pop star and DB golden boy Jason Lee. It’s not just that he’s charming, sexy, and ridiculously talented. He’s also the first person who really understands how badly she wants her star to rise. \n🌟\n#shine #shinebook #jessicajung #girlsgeneration #kpop #arc #advancedreaderscopy #onthebed #kpopidol #kpopers #kpoplover #kpopworld #kpopnews #kpoplove #jessicajungfans #jessicajungisback","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/120736992_745128122702431_2310699327175890176_n.jpg?stp=c0.156.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=DKX7mKjG5poAX89JgI_&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBNlkF7BOMHsXiQ-dpNxs-VOSiHBXkPn-1hktEgjourMQ&oe=636E7F6E&_nc_sid=76ac9f"},{"text":"• Muitas pessoas desistem dos seus sonhos ou alvos por causa do medo. Pode ser medo de tentar, medo de falhar, medo do julgamento de outras pessoas ou medo de receber alguma punição de alguém. Mas ter medo não vai te ajudar em nada. E às vezes precisamos fazer algo mesmo com medo. Não deixe que o medo atrapalhe você. E não desista!\n\nShine é um livro escrito pela Jessica Jung, ex-integrante do Girls' Generation, onde ela conta a história de uma garota que sonha em ser uma K-idol. A história mostra como é a indústria do K-pop e a vida de um trainee onde a personagem principal enfrenta diversos desafios a fim de alcançar o seu sonho de debutar. Além disso, a história é baseada experiência pessoal de Jessica no ramo da música. \n⠀\n\nEu super indico o livro, a história é incrível e rica em detalhes que deixam a leitura maravilhosa. \n\n⠀\n~Joonyoung 🐼 \n\n⠀ \n🔸️Não retirem sem dar os créditos!\n🔸️Se repostar nos marque! \n\n🔸️Siga @ticketkpop_itnw para mais conteúdo sobre K-Pop e dramas.\n\n🔸️Visite nosso site Into The New World\n⠀ E canal no YouTube Ticket Kpop.\n📌 LINKS NA BIO \n\n⠀ \n\n• Parcerias: \n\n@nct_kbecky\n@kimdoyoungbrasil\n@chicagojsuh\n@fatosnctv\n@_nctbr\n@lojanctzen\n@monstaxbrazil\n@straykidsbr__\n@vcsabiasmfamily\n@ateez_zueiro.br\n@haecelest\n@portal_astrobrasil\n@nct_brasil01\n@neocity_photography\n@yourskpop.br\n\n+ nos destaques \n\n⠀\n\n🏷 #jessica #jessicajung #shine #shineumachancedebrilhar #shinebook #shineeveryday #readshine #girlsgeneration #snsd #gg #jessicabrasil #sica #snsdbrasil #snsdot9 #gg4eva #snsdupdate","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/191407632_301101321563616_1873522244441543466_n.jpg?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=-M2APZDPx4gAX8glAYG&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDEXr1oh1ym-yDzoaM46vyp6-7ecCFLlmSpsej5JByz8w&oe=636E7BB4&_nc_sid=76ac9f"},{"text":"October is the perfect time to shout-out Asian authors and books 🌏\n.\n(Part 2/4)\n•\nThank you @glasstownent for the free book ARC and merch!\n•\nThis ARC was provided for review, but in no way affects the following impartial and unbiased review:\n•\n4*\nPros: A perfect mix of the love for K-pop and the  endearment of K-dramas. Down-to-earth portrayal of what it is like to begin a life as a musician and performer in Korea. Talks about the exploitation by big entertainment companies, the poor living conditions, the pressure and impossible expectations, the double standards and sexism, among many other (often taboo) issues in the industry. Also showcases the love for the art, the magic of performing and doing what you love. Can't wait for the sequel.\n.\nCons: Lackluster romance and romantic interest. Includes some of my least favourite tropes, such as the ditching-your-friends-as-soon-as-you-make-it trope that definitely should not still be a thing.\n•\nShine, by Jessica Jung is fresh on the shelves, grab your copy!\n•\n• Do you listen to K-pop? What are your favourite singers/bands?\n•\n#bookstagram #bookish #yalit #yalovin #youngadultbooks #yacontemporary #yareads #shine #bookreview #bookrecommendations #arcreview #netgalley #glasstownent #glasstownentertainment #autumnvibe  #cosyvibes #cozyvibes #fallweather #jessicajung #fallbooks #ownvoices #ownvoicesbooks #asianbooks #asianauthors #shinebook #simonandschuster","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/121116451_3159917194131398_7570162449497196088_n.jpg?stp=c0.135.1080.1080a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=-RYrnHH8sJYAX9HHnnP&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCe9bfp32TCSXiPEA_R3hFAwZImOugjHXV-NXEsg_K32w&oe=636F96D9&_nc_sid=76ac9f"},{"text":"Happy New Year all you bookish babes!!! 🎆🎉🥳\n.\n.\nDo any of you make resolutions? I’m not really one to make them honestly, I hate setting myself up for failure. So if I had to say the goal this year is to just be better. That’s all I want. To be a better human, a better wife, a better friend and a better coworker. 🤷🏻‍♀️\n.\n.\nShine took me (Annie) by complete surprise, though I’m not entirely sure why. It’s a contemporary that features a girl who’s going for her dream, taking her last shot at becoming the next big K-pop star. Of course there’s a boy. Of course there’s drama and shenanigans. And there’s a really good discussion on double standards in the industry. Now I know next to nothing about K-pop so I can’t tell how accurate all that is but I’m willing to bet it’s pretty accurate since the author is a former K-pop star so... but I really enjoyed this book. I thought it was lovely and such a fun escape from the common Hollywood actress story while still have the drama of being famous, or almost-famous. Also a super cool side note I figured out while in the store, there are three different spine colors and three different author photos! It took me wayyyyy too long to decide which one to get🤦🏻‍♀️🎆💗🍾\n.\n.\n#bookstagram #shinebook #pinkandgoldbook #yalit #yacontemporary #yabooks #ireadya #allthebooks #morebooksplease #letscelebratewithagoodbook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/134664087_905189946909067_2060612722040224079_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=TcrPQ3jT0AsAX_zbQDK&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBQ2I7mWQ50mahDWFBmr29bIohyOP-ZwHEy5v4wz0eFOA&oe=636F412A&_nc_sid=76ac9f"},{"text":"shine\n\n- 330 รสลทบ.\n*ต่อราคาได้ , สอบถามเพิ่มเติมได้ครับ\n\n#jessicajung #shinebook #shine","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/313212925_461759142767039_4195303140420589821_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=kDsVPpdIuDUAX_kMGa8&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAvIPJ4_5I8MWqGkOzPfOE6ou_4zBP58y7bNedRqapsKg&oe=636FA00A&_nc_sid=76ac9f"},{"text":"That night in Live Poets was themed “Women”  and amongst the mix of performances there were two special women who had followed their vision to bring their work from Australia to Wales and having met Swansea Live Poets during lockdowns via Zoom events we had the privelage of hearing , seeing and participating in a free gifted creative workshop with Skylar and Neshka the following morning in the Glyn Vivian art gallery.  Diolch yn fawr to you both\n#shinebook #australianpoet #australiaartist #creativecollaborations #swanseapoetry #womensupportingwomen","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/312384054_475986024565516_8065615083887244010_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=yyGIDcw9W44AX9yK1Wy&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCh1PUYjdlOJiObQPjAt6fTzKD3lvmftqvHQSHVgKTEaw&oe=636DE3AF&_nc_sid=76ac9f"},{"text":"Novel about the Kpop industry including it’s dark side. This is book 2 of the series. I’m not sure if she’s going to write a third.  #jessicajungfashion #jessicajungstyle #jessicajungfans #jessicajung #brightbook #shinebook #kpop #koreannovelrecommendation #koreannovel #booktok #booksbooksbooks #bookstagram #pumpkinseason #autumnvibes #popsingers #authorsofinstagram #koreandrama #bookrecommendations","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/309161829_173890908517662_6338348056271481237_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=soYPqMRBsXkAX9FXdSR&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCcUOL6eo4HAcTC3efLgg8GiRB8Eig2mNrFAsEa2XOGsA&oe=636F3F0F&_nc_sid=76ac9f"},{"text":"XOXO by Axie Oh - I rated it ⭐4.8 stars and one of my favorite books💕\n\nShine by Jessica Jung - I rated it ⭐4 stars\n\n#xoxobook #axieoh #shinebook #jessicajung #kpop #romancebooks #bookrecommendations #booklover #booksph #bookstagram #bookstagramph","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/301378042_1123276084968371_876266996268894459_n.webp?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=1jLOVglVPp8AX91L8S_&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCVjS7dEZ4ToaYeKLSrcitecge7T4JjcXyYbzSAyGxgJQ&oe=636DBAFA&_nc_sid=76ac9f"},{"text":"FINALLY GOT JESSICA JUNG’S BOOK \"SHINE\".\n\n LET’S GOOOOOOOOOOOOOO!! ❤✨📖\n\n#jessicajung #shine #shinebook #snsd #ot9forever #girlsgeneration","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/300203825_475037344132740_4678692964160804066_n.webp?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=6G7NIuSC7QcAX-I5uJq&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAPoaCYv0JwdNKQD0EodyNwynz-onVUvCIuR43YRbX7XQ&oe=636E4D5A&_nc_sid=76ac9f"},{"text":"✨️ \"Through it all, there was K-pop. It made me feel understood, like there was a place in the world where I belonged, where people would see me for me.\"\n-Jessica Jung (@jessica.syj)✨️\n\n✨️ Q: Are you a fan of K-pop?\n\n✨️ A: I can't say I'm a huge fan but I've listened to a few songs mainly by BTS. Yesterday I met up with a old college friend and her Philly BTS army friends and we all spent the day going to various BTS pop-up events and BTS Army meet-up activities. Even though I wasn't a fan it was a great time! If you want to read about K-pop I would recommend Shine, it's been my favorite K-pop book so far but it does get a bit darker than I would've expected- and the author is a former K-pop star in Girls Generation! 🌟 \n\n#kpop #shine #bright #girlsgeneration #simonteen #shinejessicajung #shinebyjessicajung #jessicajung #jessicajungshine #bookstagram #simonandschuster #simonpulse #shinebook #bookphotography #readingismagic #kpopbook #booksaboutkpop #booksbooksbooks #booksofinstagram #booksofig #booklove #bookfeature","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/292479680_3289678747927338_6019060586857968655_n.jpg?stp=c0.169.608.608a_dst-jpg_e15&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=106&_nc_ohc=RgVsj_ZnZ8UAX_45zSO&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAQ6fVA8AxUAgZPF7-al3cdyx2goRkmi6BP85_SZzsAeg&oe=636B7FBB&_nc_sid=76ac9f"},{"text":"May book read 📖 \nSNSD is one of my favorite kpop girl groups of all time and Jessica was also one of my bias in the group. so I definitely wanted to check this book out. Looking forward to reading the sequel next.💗 @jessica.syj\n📖 Tags: #shine #shinebook #jessicajung #jungjessica #kpop #bookstagram #book #books #ya #yabooks #mayreads #bookofthemonth #kpopbook #snsd #girlsgeneration #snsdjessica #booksofinstagram #shinebyjessicajung #shineanovel #youngadultbooks #youngadult","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/284904833_180392451004024_7798975830471618933_n.webp?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=104&_nc_ohc=502ycflp2okAX8yuUUO&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAJukb2R8BcEX1zyk7ccLdqmLXvEK4sUcP4RD3IN4CEtg&oe=636F7F3A&_nc_sid=76ac9f"},{"text":"✨ От днес в книжарниците можете да откриете втора част от поредицата #Блясък на известната К-поп певица #Джесика Чон – СЛАВА. ✨ \n\nКнигата ни среща отново с Рейчъл Ким, която сякаш има всичко – част е от най-известната К-поп група в света, a неин тоалет привлича вниманието на едно от най-големите имена в модния свят. Рейчъл вярва, че не би рискувала кариерата си, дори в името на любовта… Докато не се запознава с Алекс. 💖\n\n#НоваКнига \n#ДжесикаЧон 🎵 #JessicaJung\n#Слава #Блясък 🎵 #SHINE\n#shinebook #shineseries\n\n#Egmont #Егмонт #Тийн #Teen #RomanticBook #KPOP #KPOPBOOK\n\n#book #reading #romanticnovels\n#egmontbulgaria #instabooks #bookstagram #booksaremagic #bookcommunity #booksforlife #booksofinstagram #readingismagic #bookloversofinstagram #readersofinsta","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/280648542_985937275398935_2231491975853048018_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=3EF22-4SOJUAX-JD3W6&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfABfDjlIwsrBkbxUX38D0WSOhwDJVm_C-9d_Zj7hmGIng&oe=636E7F29&_nc_sid=76ac9f"},{"text":"🎤Book Tour 🎤\n\nBright by @jessica.syj \n\nAre you a K-Pop fan?  To be honest, I haven’t listened to much and I couldn’t tell you the names of any groups besides BTS, but the music videos I’ve watched are pretty entertaining and the music sticks in my head. \n\nSynopsis:\nThe sequel to the instant New York Times bestseller Shine! \nCrazy Rich Asians meets Gossip Girl in this knockout series from Jessica Jung, K-pop legend, fashion icon, and founder of the international luxury brand, Blanc & Eclare.\n\nCouture gowns, press parties, international travel. Rachel Kim is at the top of her game. Girls Forever is now the number-one K-pop group in the world, and her fame skyrockets after her viral airport styling attracts the attention of fashion’s biggest names. Her life’s a swirl of technicolor glamour and adoring fans. Rachel can’t imagine shining any brighter.\nThe only thing that’s missing is love—but Rachel’s determined to follow the rules. In her world, falling in love can cost you everything.\n\nEnter Alex. When Rachel literally falls head over designer heels into his lap on a crowded metro, she’s tempted to give up her anti-love vows. Alex is more than just heart-stopping dimples and adorably quirky banter. He believes in Rachel’s future—both in music and in fashion.\nBut the higher you rise, the farther you have to fall. And when a shocking act of betrayal shatters her world, Rachel must finally listen to her heart.\n\nThere is a giveaway going on for a set of both books. Check out the link in my bio for the giveaway information!\n\nThank you to @turnthepagetours and @simonteen for having me on this tour and for the #gifted ARC and finished copy. \n\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung #kristensreadingnook #booktour #booktours #kpop #bts #kpopmusic #kpopmusicvideo #bookstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279928723_1116500382249213_4839425283906386501_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=mvuF1EFks-sAX_8n2w2&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCQitrF-W98cYePrBOo0yJgdaF7Ub4vqPOZd5kYZjQYtQ&oe=636DBE90&_nc_sid=76ac9f"},{"text":"✨What would you do if you were in the biggest K-pop group in the world?\n\nRachel Kim is at the top of her game with her group Girls Forever. But there’s a lot more underneath the veneer of glitz and glam…\n\nBRIGHT by Jessica Jung was such a fun read (see the full summary in the comments)! Thank you @turnthepagetours and @simonteen for having me on this blog and bookstagram tour! Swipe to see my BRIGHT-inspired playlist ➡️\n\n🔗Read my review (and enter the giveaway 👀) at the link in bio!","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/280061281_414470966795149_7147388729509729067_n.jpg?stp=dst-jpg_e35_s1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=KQLKp7V_CQwAX-Ct9ju&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCaD1C2jhwzYTDVkYA7SyGc28M57hYFp7BEM3MDSNNwiw&oe=636F8739&_nc_sid=76ac9f"},{"text":"Do you listen to kpop? Who are some of your favorite artists? 🫶\n\nSome of my favorites are IU, BTS, Seventeen, Twice, Mamamoo, and SNSD! I also recently started listening to Enhypen!\n\nI remember when Shine came out, I was super interested in reading a novel written by a kpop idol. And now the sequel, Bright by Jessica Jung, is coming out! 💓\n\nA few years after the events that occurred in Shine, we follow Rachel as she falls in love and tries to find her true self. Similarly to the first book, Rachel is subjected to the harsh dynamics faced as an idol within the kpop industry with unexpected betrayals. Drama and intrigue thus ensue, along with a possible romance? 👀\n\nCompared to the first book, Bright focuses a little less on the criticism and critique that comes alongside fame and more on the romance that develops between Rachel and Alex. I must admit, I did find the first book a bit more intriguing as we learn about everything behind-the-scenes of a kpop idol (written from a kpop idol herself)! There's a lot of double standards, body shaming, and foul play as Rachel enters the industry. That's not to say that she isn't subjected to similar treatment even after she's become more famous, but the author has instead chosen to prioritize Rachel's journey in self-discovery more in this sequel. We learn more about Rachel's entry into the world of fashion and music as well as how she manages a potential relationship.\n\nAs someone who got into kpop somewhat more recently (around 2 years ago?), I found this duology to be fascinating insight into the kpop industry and the struggles that idols face. I still wonder to what extent these stories are fiction, and how much of Rachel's experiences mirror the authors...🤔\n\nThank you to @turnthepagetours and @simonteen for sending me this copy and allowing me to join this tour! You can find my review in my bio (+ a giveaway and the full schedule for this tour)!✨\n\n☁️ I also really appreciate that the publishers created a reversible dust jacket so that you can have the covers match both the paperback and the original hardcover!\n\n#turnthepagetours #brighttour #shinebook #brightbook #jessicajung","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279826182_1219752942145130_3046315760506115078_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=rhLYlWZjSsIAX8akmbn&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCHqsnjAYJiiPGNE9kptBXDOgWoIqdfPBwuq59j8QjXTQ&oe=636E3E01&_nc_sid=76ac9f"},{"text":"***Bright StoryGram Tour***\n \n \nWhat song(s) are you playing on repeat?\n•\n•\nFrank - Boys Don’t Cry by Anitta and The AUDACITY by Emlyn\n•\nKarinna - Inside by Bo Burnham\n \n \nThe sequel to the instant New York Times bestseller Shine! Crazy Rich Asians meets Gossip Girl in this knockout series from Jessica Jung, K-pop legend, fashion icon, and founder of the international luxury brand, Blanc & Eclare.\n \nCouture gowns, press parties, international travel. Rachel Kim is at the top of her game. Girls Forever is now the number-one K-pop group in the world, and her fame skyrockets after her viral airport styling attracts the attention of fashion’s biggest names. Her life’s a swirl of technicolor glamour and adoring fans. Rachel can’t imagine shining any brighter.\n \nThe only thing that’s missing is love—but Rachel’s determined to follow the rules. In her world, falling in love can cost you everything.\n \nEnter Alex. When Rachel literally falls head over designer heels into his lap on a crowded metro, she’s tempted to give up her anti-love vows. Alex is more than just heart-stopping dimples and adorably quirky banter. He believes in Rachel’s future—both in music and in fashion.\n \nBut the higher you rise, the farther you have to fall. And when a shocking act of betrayal shatters her world, Rachel must finally listen to her heart.  \nThank You to @simonteen for gifting me a copy of this incredible book!\n•\n•\n•\n•\n#Bright #JessicaJung #SimonTeen #StoryGramTours #BrightTour #Shine #JungSooYeon #BrightByJessicaJung #ShineEveryday #GirlsGeneration #KPop #Booksta #ReadABook #BookJunkie #ShineBook #BrightBook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279839379_145426681381694_2511721495809561476_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=102&_nc_ohc=xzjHR9U112wAX9-LJ2-&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBRjOjscT2yrLXd3G8j4tFbxHEGS5_xuIjIbZXrD1tS-A&oe=636F8D0B&_nc_sid=76ac9f"},{"text":"Who's your favorite band? Personally I love BTS, Andrew McMahon & the Wilderness, and The Beatles!\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nThank you to Turn the Page Tours for having me on the tour and I hope ya'll will check out Jessica Jung's series.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n------review------\nI looooove me a K-pop book, but it's so rare to get one focused on a new adult age range. Rachel debuted with Girls Forever 5 years ago, but is still having issues finding balance in her life. Everything that I loved about Shine is still present in this book - the fashion, the music, the drama, but there are darker elements as well. We get to examine some of the more toxic group dynamics of Girls Forever, as well as how far people will go to get ahead. It was amazing seeing Rachel enter the world of fashion and business, but I hope we get a third book still. Maybe with another time skip? Rachel's story is far from over, and she definitely has some unsettled business. (Also Alex is THE cutest boyfriend. I'd love to wake up to his texts)\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n*Thank you to Turn the Page Tours and Simon & Schuster Children's for an ARC in exchange for my honest review*\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\n------synopsis------\nCouture gowns, press parties, international travel. Rachel Kim is at the top of her game. Girls Forever is now the number-one K-pop group in the world, and her fame skyrockets after her viral airport styling attracts the attention of fashion’s biggest names. Her life’s a swirl of technicolor glamour and adoring fans. Rachel can’t imagine shining any brighter.\n⠀⠀⠀⠀⠀⠀⠀⠀⠀\nThe only thing that’s missing is love—but Rachel’s determined to follow the rules. In her world, falling in love can cost you everything.\n.\n.\n.\n.\n.\n.\n.\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung #simonteen #ireadYA #booksta #YAseries #kpop #diversereads #kdrama #YAbooks","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279837031_1556030851464195_410016709520718026_n.jpg?stp=c0.150.1200.1200a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=bC_C-pQ0HpQAX8p8ebr&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBcHMebUFHXhe-HA22QqROSNcSsaI0paHlngGperqdTjg&oe=636F842B&_nc_sid=76ac9f"},{"text":"Look at this amazing post from Julith for our Tour! There’s a giveaway going for both books in this duology, so hit the link in our bio to enter! \n-\n-\n-\n\nRepost from @nerdy_little_julith with @make_repost\n・・・\nWhat are some book sequels you’re excited to read this year?\n.\n.\n💫 Bright is the follow up to Shine by @jessica.syj and it was a fun read! \nIf you haven’t yet read Shine, you’ll definitely want to before reading this one! I really enjoyed seeing our main character, Rachel, in a different way in this one with the time jump that takes place! It was something I wasn’t expecting but I really appreciated reading it this way! Overall, it was fun and kept me entertained! \n\nIf you’re familiar with Shine, you’ll notice that the books have gotten a new look with brand new covers for both! One really cool thing that the publisher has done is that the Bright dust jacket is reversible so you can have it match either the new cover or the original cover of the first book! Isn’t that the coolest thing?! 🤩\nBright will be out May 10th be sure to check it out! Thank you so much @simonteen @turnthepagetours for my gifted copy & for having me on the tour! 💖\n———\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung \n#bookstagram #bookcommunity #bookinfluencer #simonteen #yalit #kpopbook #ireadforfun #shinebright #booklover #bookreader #ilovetoread #newbookrelease #bookreview #bookrecommendation #readingisfun #kpopisthebest #booksmakemehappy #dailybook #bookblog #igreads #bookoftheday #wellread #readallthebooks #readinglove #bookblogger","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279781557_699622521283483_4577289446937452516_n.jpg?stp=c0.95.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=ylOr3TiJLsIAX_jNdPg&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAK6P_8EfYof6cP9xOFP7cgLl6agiOGg8CvqeW4RVPioQ&oe=636DD1D5&_nc_sid=76ac9f"},{"text":"What are some book sequels you’re excited to read this year?\n.\n.\n💫 Bright is the follow up to Shine by @jessica.syj and it was a fun read! \nIf you haven’t yet read Shine, you’ll definitely want to before reading this one! I really enjoyed seeing our main character, Rachel, in a different way in this one with the time jump that takes place! It was something I wasn’t expecting but I really appreciated reading it this way! Overall, it was fun and kept me entertained! \n\nIf you’re familiar with Shine, you’ll notice that the books have gotten a new look with brand new covers for both! One really cool thing that the publisher has done is that the Bright dust jacket is reversible so you can have it match either the new cover or the original cover of the first book! Isn’t that the coolest thing?! 🤩\nBright will be out May 10th be sure to check it out! Thank you so much @simonteen @turnthepagetours for my gifted copy & for having me on the tour! 💖\n—————————\n✨ Book synopsis will be in the comments! There will also be a link in my bio to giveaway from the publisher for both Shine & Bright!✨\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung \n#bookstagram #bookcommunity #bookinfluencer #simonteen #yalit #kpopbook #ireadforfun #shinebright #booklover #bookreader #ilovetoread #newbookrelease #bookreview #bookrecommendation #readingisfun #kpopisthebest #booksmakemehappy #dailybook #bookblog #igreads #bookoftheday #wellread #readallthebooks #readinglove #bookblogger","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279855710_784444912942035_5598652329934706398_n.jpg?stp=c0.94.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=eBsqQsDKY8UAX9p3BzX&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDyGr17q1PuE0ffQ8UNIdJQ-nXcYN-JkSLAuFM26JVLeg&oe=636E399C&_nc_sid=76ac9f"},{"text":"QOTD: Where are my fellow\nS🖤ONEs at? Do you have a fave song by Girls Generation? Let me know!\n\n💎Tour Stop💎\n\nWelcome to my stop for Bright by @jessica.syj alongside @turnthepagetours! \n\nBright is YA contemporary novel centered around the world of KPOP. It is the sequel to the NYT bestseller Shine and it will published by @simonteen on May 10, 2022! Thanks to them for sending me a stunning copy!\n\n💎Synopsis💎\n\nCrazy Rich Asians meets Gossip Girl in this knockout series from Jessica Jung, K-pop legend, fashion icon, and founder of the international luxury brand, Blanc & Eclare.\n\nCouture gowns, press parties, international travel. Rachel Kim is at the top of her game. Girls Forever is now the number-one K-pop group in the world, and her fame skyrockets after her viral airport styling attracts the attention of fashion’s biggest names. Her life’s a swirl of technicolor glamour and adoring fans. Rachel can’t imagine shining any brighter.\nThe only thing that’s missing is love—but Rachel’s determined to follow the rules. In her world, falling in love can cost you everything.\nEnter Alex. When Rachel literally falls head over designer heels into his lap on a crowded metro, she’s tempted to give up her anti-love \nvows. Alex is more than just heart-stopping dimples and adorably quirky banter. He believes in Rachel’s future—both in music and in fashion.\nBut the higher you rise, the farther you have to fall. And when a shocking act of betrayal shatters her world, Rachel must finally listen to her heart.\n\n💎Review💎\n\nComing soon!\n\n💎Giveaway💎\n\nThere is one (1) set of both books: Shine & Bright available. \n\nYou can enter here:\n\nhttp://www.rafflecopter.com/rafl/display/1e4a114d67/?\n\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279721402_3266563336946863_4529600295589490538_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=107&_nc_ohc=MMnFZVCYPT8AX-tCMma&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCOJTOV53qyUp6kTpZZGbPMtWny-2kanQ2-mPdwnEDq6A&oe=636E8984&_nc_sid=76ac9f"},{"text":"QOTD: stand-alones or sequels?\nAOTD: I like stand-alones within a series. That way the romance isn’t dragged on for multiple books, but we still get the characters we know and love. \n\nI was so excited when I saw that Shine by @jessica.syj was getting a sequel! I loved the first book and knew that I had to read the second. Thank you to @turnthepagetours and @simonteen for organizing this book tour! \n\nI received both an ARC copy paperback (pictured) and a hardcover with a reversible jacket which I’ll be sharing soon! They are both gorgeous and I can’t decide which one is my favorite. \n\nBright is a ‘Crazy Rich Asians meets Gossip Girl in this knockout series from Jessica Jung, K-pop legend, fashion icon, and founder of the international luxury brand, Blanc & Eclare.’ Full synopsis in comments ☺️\n\n#turnthepagetours #BRIGHTtour #Shinebook #Brightbook #jessicajung","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279758780_522925776035544_7401243893817189190_n.jpg?stp=c0.180.1440.1440a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=100&_nc_ohc=EiiKDQZg2jcAX-OTgFc&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBu8d42HCfNSOPXjKhYY7jh1LJG0YmxKDxI1h0DUb2Vcg&oe=636E7F19&_nc_sid=76ac9f"},{"text":"2: СЛАВА • ДЖЕСИКА ЧОН • в предварителни поръчки на egmontbulgaria.com ✨ В книжарниците от 14 май 🏰\n\n🌟 Продължението на #Блясък 🌟\n\nРейчъл Ким е на върха на славата и изживява мечтата си. Турнетата, партитата и концертите са част от ежедневието ѝ, а „Гърлс Форевър“ е най-известната к-поп група в света. Всичко в живота ѝ изглежда съвършено. \n\nЕдинственото, което липсва е любов. Докато не среща Алекс.\n\nЗапознанството им преобръща представите ѝ за любов и на Рейчъл ѝ става все по-трудно да спазва най-важното правило в к-попа: Никога не се влюбвай.\n\nДали ще успее да загърби желанията си, или най-накрая ще се вслуша в сърцето си? 💖 ✨\n\n#НоваКнига #ДжесикаЧон #Слава #Блясък \n#JessicaJung #SHINE #shinebook #shineseries \n\n#Egmont #Егмонт #Тийн #Teen #RomanticBook #KPOP #KPOPBOOK\n\n#book #reading #romanticnovels\n#egmontbulgaria #instabooks #bookstagram #booksaremagic #bookcommunity #booksforlife #booksofinstagram #readingismagic #bookloversofinstagram #readersofinsta","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279390727_569659081026815_4010083771684838260_n.jpg?stp=c0.135.1080.1080a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=111&_nc_ohc=Vh50htNZ8hIAX8IPEh3&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfAyvCgHYPg38xpzN61dmTQqFKWw9x3ImVq7Wduwm3T_dg&oe=636F3E47&_nc_sid=76ac9f"},{"text":"🌷Spring Vibes🌷 \n\nSummer is coming so fast, and I have to say it’s not my favorite season because sometimes it gets too hot ☀️ I’m going to miss Spring a lot \n\nI was reading So This Is Ever After, but I decided to put it down for now so I can read something that isn’t fantasy. At the moment, I’m now reading Shine by Jessica Jung @jessica.syj \nSo far I’m learning that being a K-Pop idol is much harder then I thought 😅\n\nI hope you all have had a wonderful weekend 💕\n—————————————————————————————#bookstagram#bookstagrammer#book#books#welovebooks#ilovebooks#bookworm#booklover#booklovers#booksaremylife#booksarelife#booked#ａｅｓｔｈｅｔｉｃ#2022#spring#april#aesthetic#shinebook#shine#jessicajung#springvibes","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/279034474_681475689637029_7189327429247586530_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=LmujRzzE6VEAX8akxoP&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfBQhgQRr-rGL1klBSXn0UBpbdRtjQdzMRN21nuBtcx_HA&oe=636ED613&_nc_sid=76ac9f"},{"text":"books that made me fall back in love with reading 💟💯 \n\nTags:\n#Shinebook #shinebyjessicajung #shinebyjessica #kpopbookstagrammer #kpopbooks #kpoplovestory #kpopbookshelf #kpopbookstagrammer #storytellerbook #storytellerbookclub #morganharpernicholspoetry #morganharpernicholsbook #morganharpernichols #xoxobook #xoxobookclub #axieohxoxo #axieohbooks #xoxobyaxieoh #romancebookshelf #romancebookrecommendation #bookrecsofinstagram #romcombooklovers #romancereadersofinstragram #fortheloveofbooksclub #fortheloveofbookstagrammers #bookwormphillippines #shelfloveandselflove #aestheticbookshots #aestheticbookcover","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/277654031_665806238018493_3059939831335946613_n.webp?stp=dst-jpg_e35&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=109&_nc_ohc=gJvSDF2MYE8AX-DhqYO&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfCHVWIOylCYGq8bmzappbQaDIpdYvU3_-GJ-ZJNWe8wwg&oe=636E6FE0&_nc_sid=76ac9f"},{"text":"'Don't downgrade your dream just to fit your reality. Upgrade your conviction to match your destiny' - Stuart Scott \n\n#DreamBig #TheSparklingStar #ShineBook #GoGetMoney","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/274879273_446304137280322_4825344063845154459_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=110&_nc_ohc=ZtOjE8ldPaYAX-W-u6Y&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfARr34KpEAvcZEvB162raWtiHkEXqWyl7VOvzDWKWu-6A&oe=636EDF8E&_nc_sid=76ac9f"},{"text":"And vice versa.\n.\nRehearsal stems from the archaic French word meaning “to repeat.” In a very real sense, as believers, we become what we rehearse-  or what we repeat- day after day. There is an undeniable potency in holy repetition, and I, for one, have a deep need for it. If we rehearse the truth that we are indeed the beloved of God through Christ, then when circumstances challenge that immutable truth, spiritual muscle memory will take over. The truth will rise, and the lie will sink- if the truth has been deeply rehearsed into our spiritual sinews.\n.\nI’m reminding my heart today: rehearse what is true, what is reflective of the Gospel, what embodies the ways and words of the Divine Author of Hebrews. For, in every sense that truly matters, I will be what I rehearse.  I will become what I repeat. ❤️\n.\n#HowAnActorSeesTheBook\n#ShineBook","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/273127938_524514325485397_212961800629230264_n.jpg?stp=dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=101&_nc_ohc=Ay8rKZgesLMAX-rFvje&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDwLvYePx-X3uZDqUB4rluHo0jwB6RSx9vgxgcbou0J6g&oe=636F997B&_nc_sid=76ac9f"},{"text":"✨CLOUD STACK☁️✨\n.\nI did this challenge maybe about a year ago, but I realized that I didn’t have one of these cloud stack pictures for this theme which felt wrong; it definitely matches the vibe of this theme much more! It also just represents my mood today because I’m kind up just up in the clouds. Anyone can do this, I’m not tagging people!\n.\nQOTD: What is a color you would use to describe the mood of your favorite book?\nAOTD: I give it a solid gray😂\n.\n☁️A Kingdom of Flesh and Fire(4/5)\n☁️The One(5/5)\n☁️Restore Me(4.5/5)\n☁️Confess(4.25/5)\n☁️Just Don’t Mention It(5/5)\n☁️A Very Large Expanse of Sea(5/5)\n☁️Shine(5/5)\n.\nHappy end of January! I hope that everyone had a good reading month by THEIR standards. If not, there is always February! Don’t forget that you are a reader no matter how or how much you read this month or any month! \n.\n♡︎","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/272987545_1524750721245296_2417036540194273076_n.jpg?stp=dst-jpg_e35_p1080x1080&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=108&_nc_ohc=ri_QlEfdkEYAX8ZdmB3&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfDrTc8neFoB9u-adIu6SjFwR6XrJ9U0OPla1yOogI-h3g&oe=636F6701&_nc_sid=76ac9f"},{"text":"#shine #책 #book #shinebook #jessicajung #bookstagram","url":"https://scontent-lga3-1.cdninstagram.com/v/t51.2885-15/272512721_1618273108550751_2597436779354580670_n.jpg?stp=c0.114.1013.1013a_dst-jpg_e35_s640x640_sh0.08&_nc_ht=scontent-lga3-1.cdninstagram.com&_nc_cat=103&_nc_ohc=y_D8oWVkNkEAX-cBpQD&edm=AOUPxh0BAAAA&ccb=7-5&oh=00_AfB_LfDUBT4NMXHyZVihGZgZMAcgbEZz19yVv5RBbkpTcA&oe=636DD528&_nc_sid=76ac9f"}]